[
    {
        "author": "c0v3n4n7",
        "url": "https://reddit.com/r/sysadmin/comments/1dj6efk/major_change_in_company_it_and_suddenly_i_got/l99zbjs/",
        "body": "If you jump into this new challenge with an open mind , you will find out that JAMF is awesome and you will end up wishing that Intune had a 3rd of it's potential.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-06-19 07:25:04",
        "upvotes": 12
    },
    {
        "author": "belgarion90",
        "url": "https://reddit.com/r/sysadmin/comments/1dj6efk/major_change_in_company_it_and_suddenly_i_got/l9b5si0/",
        "body": "The Jamf training is really pretty good. The 200 course is easily worth the week and $2500.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-06-19 14:03:53",
        "upvotes": 1
    },
    {
        "title": "Jamf vs. Kandji in 2024?",
        "author": "AppearanceAgile2575",
        "url": "https://www.reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/",
        "body": "Currently using Jamf Business and discussions around renewal have begun. I am wondering if it is worth staying on Jamf in 2024 as a Kandji license (w/ liftoff) + a license for a more robust (third-party) EDR than Jamf Protect costs less than a Jamf Business license.\n\nI know Jamf has a more powerful API, but we are a relatively small shop and most Mac administration is currently done via Jamf’s GUI.\n\nAside from that, any pros for Jamf or cons for Kandji, that warrants the difference in price, I should consider before making the change?",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "subreddit": "macsysadmin",
        "created": "2024-03-25 17:21:31",
        "upvotes": 28
    },
    {
        "author": "bwats16",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwiw254/",
        "body": "We like Kandji and are very happy with switching from Jamf. Their auto app patching and user friendly UI (both in the console and on device) is what put it over the top for me.\n\nLiftoff is super nice (we’ve gotten multiple compliments from end users) and we can confidently be zero touch and have a great experience for our employees.\n\nSomething that hasn’t been said but has been my favorite “feature” of Kandji is their support team. Jamf’s is notoriously bad (they make it up with a great community) but with Kandji, you can open up a live chat in the admin console with an agent and be chatting in < 3min. Any issue, big or small, they are right there to help with.\n\nPlus it’s cheaper lol.\n\nEdit: I also forgot to mention the one thing I miss from Jamf is smart groups.. that is the one thing I really feel like Kandji is lacking. Other than that, they are apples to apples with Kandji taking the slight edge.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-03-25 18:34:08",
        "upvotes": 13
    },
    {
        "author": "SubKreature",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwju10b/",
        "body": "Test piloting Kandji currently as a replacement to Jamf.  It has resolved literally every issue we’ve had with Jamf since day 1 of the trial.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-03-25 21:42:22",
        "upvotes": 3
    },
    {
        "author": "ObjectiveAthlete2437",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwimm5u/",
        "body": "You can't really scale with Kandji as witnessed with most organisations with a large install base. From the automated remediation perspective, nothing beats Jamf Pro and Jamf Protect, which is fully integrated for sub minute response. Aside from that, Kandji has limited runway in terms of financing and funding from investors. They are literally on a cash burn without any solid plans for the future. I wouldn't bet my career on a company that might go bust anytime soon.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-03-25 17:42:24",
        "upvotes": 7
    },
    {
        "author": "jaq2",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/lqtqolg/",
        "body": "We've been on JAMF for about 4 years now and the renewal price prompted management to ask us to look for alternatives. One of the execs had been in contact with Kandji already who had been pitching they were a cheaper option so we reached out and setup a trial. I was very clear the only reason we were considering moving was price.\n\nAlthough I was impressed with Kandji and we were able to replicate about 60% of what we use JAMF for in the first week of trail, they still hadn't given us a quote. They had asked if they could see what we were paying for JAMF before quoting us and that seemed a bit shady. Like a plumbing contractor wanting to see your other bids before quoting a job. We figured they had standard pricing, but depending on the number of clients and perhaps multi year contracts they could give us a lower than standard pricing. Well, this morning they finally gave us our quote after we told them we weren't comfortable showing what we were paying for JAMF first. It was more than we currently pay for JAMF AND that included a 20% discount if we signed up quickly.\n\nI can't think of any other company we deal with that tries to price this way.\n\nThey quoted us mid $30,000s for 400 system and that doesn't include their end point protection.\n\nAnyone out there mind sharing what they currently pay for Kandji and how many seats? The sales rep told me they've seen people paying between $4/seat/month for JAMF up to $14/seat/\n\nJamf pro's standard pricing is $7/seat/month right now for just the MDM, so I'm not sure where he's getting numbers higher than that unless that includes extra Jamf services that we don't have and were never part of our conversation.\n\nComments on here seemed mostly positive and everyone seemed to indicate they were substantially less expensive.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-10-07 19:34:13",
        "upvotes": 2
    },
    {
        "author": "Alternative_Sense938",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwl3kk6/",
        "body": "We switched from Jamf Cloud with Connect to Kandji two months ago. So far we absolutely love it. To us, Jamf was a toolbox whereas Kandji was ready to use out of the box. We love the layout and readability of the console, even the creature comforts like being able to see details about a blueprint item without having to go to the library whereas Jamf would require you to open another tab to compare two pages. The things visible to the user, such as Passport and the agent, have a much nicer appearance and appear to belong in macOS, unlike Jamf.\n\nWe had our demo environment doing great in one week. Most of our profiles were recreated and configured within a week. We find Passport to be more reliable and user-friendly than Connect. Liftoff has worked perfectly. The user agent does well to inform the user of updates or actions needed.\n\nWe actually migrated at a fast pace. Our Jamf contract was ending two weeks from the day we signed with Kandji, and since they don't let you test the migration tool we risked it.\n\nWe had one major migration hurdle: Jamf was deploying Wi-Fi via a config profile. As soon as Kandji forced Jamf to unenroll a device it would lose the office Wi-Fi connection and the device was stranded because the deletion of the config profile removed the active SSID. To mitigate, we started a temporary Wi-Fi network, pushed it as a script, and then the Kandji migration tool would wait long enough for the device to see the temp network and connect.\n\nWe made it! Before Jamf expired we sent all remaining devices (there weren't many) an MDM unenroll command from Jamf. In Apple Business Manager we pointed all devices to Kandji. Then those devices could do sudo profiles -N to re-enroll based on what Apple Business Manager pointed them to.\n\nKandji's use of rules on blueprint items means we only need a few blueprints. We chose to do one blueprint for production, one for conference room equipment, and one for secured special devices. Other blueprints can be used for testing.\n\nKandji Prism is a new search feature that works well.\n\nIt's nice that Kandji licenses users instead of devices. We can now enroll iPads, iPhones, and Apple TVs along with Macs.\n\nI do have to give Kandji one F grade: You're assigned a migration specialist at the start. This is who provides your custom migration script. In our case the specialist only responded to us about once a day no matter how urgent. They also said more than once that they had added colleagues to our case but we never heard from anyone else. On the flip side, chat support and their documentation has been great.\n\nIf you are looking for something that works well from the start, Kandji is not a bad choice. I'm looking forward to full Platform SSO authentication support next year. (Giving it time in the oven.) Apple is still polishing it and Kandji supports it but we want to let them work any bugs out.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-26 02:23:00",
        "upvotes": 7
    },
    {
        "author": "drkstar1982",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwjapvx/",
        "body": "Just fyi on the patching part. JAMF Pro cloud does have the ability to do patching via DDM. I have about 1260 users worldwide and our first big test of DDM got us to 99% compliance within 24 hours of our schedule update deadline. Which is a miracle.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-03-25 19:55:07",
        "upvotes": 4
    },
    {
        "author": "drkstar1982",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwl7bex/",
        "body": "Its for the OS, we have been using the JAMF catalog with decent results for some time to patch 3rd party apps including Adobe ones. The only thing we dont patch that way is Chrome.\n\n&#x200B;\n\nhttps://learn.jamf.com/en-US/bundle/jamf-pro-documentation-current/page/Declarative\\_Device\\_Management.html",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "created": "2024-03-26 02:48:14",
        "upvotes": 1
    },
    {
        "title": "Recommendations needed - Moving from Jamf to a new MDM, Jamf Connect like features are critical.",
        "author": "sudo_brandon",
        "url": "https://www.reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/",
        "body": "I have been a Jamf Pro admin for since Casper, 400 certification, managing 1000+ endpoints globally (100% mac)... We have to leave Jamf due to costs.  We are looking at Kandji, Jumpcloud, and Mosyle.  Okta is are idP but we are entertaining moving to Jumpcloud as well.  In Jamf we heavily rely on Extension Attributes, Smart Groups, and Jamf Connect.  What are your recommendations?  What are you using with likes/dislikes?   \n\nMy likes/dislikes with Jamf Pro is a great product but it's expensive.  It's reliable until the binary breaks and produces 'Lost Sheep' that dont check-in.  The interface is very solid but there is a steep learning curve.  I fought hard to keep it and demonstrated the massive difference between Jamf and Kandji but I lost the C-level money war.\n\nYour advice will help tremendously. ",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "subreddit": "macsysadmin",
        "created": "2024-08-22 13:58:53",
        "upvotes": 22
    },
    {
        "author": "Snowdeo720",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljfkn2k/",
        "body": "Check out Addigy.\n\nHonestly Addigy Identity is a really solid solution, works with AD, Google, and Okta with no hassle.\n\nI’ve moved the last three companies I’ve worked for from JAMF to Addigy.\n\nWe reduced our overall MDM cost year of year while massively increasing features and functionality.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-08-22 19:56:51",
        "upvotes": 7
    },
    {
        "author": "FearInc4",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljequtc/",
        "body": "I’m a Kandji admin and can highly recommend it. You will be missing things that Jamf has, but for the price difference you won’t be missing much.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-22 17:23:22",
        "upvotes": 4
    },
    {
        "author": "drosse1meyer",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljds9zn/",
        "body": "you can still use jamf connect, but its expensive no matter what if you are cost cutting,. also i would rather have jamf pro and no jamf connect than vice versa.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-22 14:24:14",
        "upvotes": 3
    },
    {
        "author": "Medical_Noise_2514",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljdwu82/",
        "body": "Hiya, former Jamf Pro/now admin currently using Kandji.\n\nYou will see much cheaper bills from Kandji, however you will lose functionality as it's not as comprehensive.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-08-22 14:48:39",
        "upvotes": 4
    },
    {
        "author": "Telexian",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljgh2nz/",
        "body": "You can still use Jamf Connect - it does not require Jamf Pro, and you can use your current plists. It’s also cheap.\n\nAlso, Smart Groups and Extension Attributes are Jamf’s specialty. You’ll miss them sorely elsewhere if you rely on them in Jamf. \n\nDon’t look at sticker price - look at TCO and value. Consider what Jamf Pro features you may not be using could add more value to what you have now, without a huge cost of re-training and man hours spent moving everything over. Not to mention the teething issues etc. that will inevitably happen. \n\nKandji gets a lot wrong in my experience. Intune is getting there but what’s missing leaves giant holes in many workflows.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-22 22:55:11",
        "upvotes": 2
    },
    {
        "author": "MacAdminInTraning",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/lk5oaif/",
        "body": "With Jamf you get what you pay for, with any of the cheaper competitors be ready to leave features on the table. Kandji is the best alternative I can think of at the moment.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-27 11:13:32",
        "upvotes": 1
    },
    {
        "author": "macsaeki",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljh4pg3/",
        "body": "Same. Smitten! All the third party crap you had to use with Jamf are native to Kandji and nice thought out interface. Support responds within minutes! Less expensive, hell yeah!",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-08-23 01:19:12",
        "upvotes": 4
    },
    {
        "author": "slopduck",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljdv42b/",
        "body": "Say what now? You're able to talk Jamf down that much?!? Maybe my shops have been too small, but I've never gotten Jamf down anywhere near Mosyle Fuse pricing levels. (Jamf is closer to 2x the price of Fuse)",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-22 14:39:29",
        "upvotes": 4
    },
    {
        "author": "FearInc4",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/lrfrzmf/",
        "body": "Jamf has more granular control and advanced connections directly from the mdm to the devices. Kandji is the click and forget platform that requires very little maintenance overall.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-10-11 16:58:16",
        "upvotes": 2
    },
    {
        "author": "0pivy85",
        "url": "https://reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/ljeeliq/",
        "body": "Don't know the magic behind it, but Kandji made us a custom pkg and script that unenrolled 2000+ devices from jamf and put them into Kandji without any need to wipe.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-08-22 16:20:26",
        "upvotes": 7
    },
    {
        "author": "huffola",
        "url": "https://reddit.com/r/jamf/comments/1fiysgb/sequoia_update_bricking_our_devices_with_jamf/lnwsafi/",
        "body": "Same issue. I have a support case in with Jamf. If trying to perform a manual install from recovery I get a message about “no user having secure token” which was not an issue prior to pushing the update. Only resolution I’ve found is to perform a DFU restore via Apple Configurator.\n\nEdit: using Jamf Pro and Jamf Connect which aligns with OPs thought of a “perfect storm” of apps seems to be causing the issue.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-19 15:32:22",
        "upvotes": 3
    },
    {
        "author": "trikster_online",
        "url": "https://reddit.com/r/jamf/comments/1fiysgb/sequoia_update_bricking_our_devices_with_jamf/lnun5w9/",
        "body": "Only weird thing I’m seeing is Jamf managed Macs will show they are connected to the internet and show an IP, but in reality, they aren’t. I have to either unplug and plug the Ethernet dongle or if on WiFi, turn it off and back on to get a valid IP and actually go online.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-09-19 04:40:43",
        "upvotes": 1
    },
    {
        "author": "enterreturn",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l29u63i/",
        "body": "Have used Jamf the past 8 years and using Kandji for the first time at my new company.\n\nIn my opinion, Kandji is complete rubbish and their sales team is incredibly heavy-handed. We asked for an extension on renewal because they hadn't completed our security evaluation. They told us we'd need to sign the renewal without the eval completed or else they would terminate our environment. Not a show of good faith in any way.\n\nJamf is much more reliable, and you can get a lot more granular in the way you scope changes. Kandji uses whats called \"Blueprints\" and its about as flexible as cement.\n\nI am making it my mission to spend the next year pushing for Jamf and getting rid of Kandji.\n\nedit: One more thing to consider, Kandji requires you to keep a license on the device if you want it to remain in Kandji. With Jamf we would remove the jamf license from a device, but the previous record would remain in the UI so that we could look back on who had the device previously and any repairs it may have had. In order to reclaim a Kandji license, you have to delete the device record from Kandji entirely. Its a cheap way to get you to have to buy more licenses.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-05-02 17:23:39",
        "upvotes": 18
    },
    {
        "author": "Cosmic_Shipwright",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2fnihw/",
        "body": "We moved from Kandji to Jamf and although Jamf has a bit of a learning curve, it’s worth it. The compliance editor template is a godsend for quickly applying security policies and the patch management is rock solid compared to Kandji. Kandji also offers less flexibility in terms of pricing. You still have to pay for 50 or 100 devices even if you have half of that and you have to get the entire suite (passport was optional before). There was also a nasty bug we encountered where even after we removed the Kandji MDM profile, the passport (IdP SSO) still stuck around and we weren’t able to enroll it to Jamf forcing us to wipe it. Their initial sales rep also gave us a pricing commitment for 3 years but when it came to renewal after one, the account manager was rotated and they jacked up our prices saying “I don’t know that guy but here’s what we charge.”",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-05-03 18:27:57",
        "upvotes": 3
    },
    {
        "author": "PiqueB",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2b6hzm/",
        "body": "We moved from JumpCloud to Kandji for 400 mac devices. Main reasons were auto app and OS patch management, small barrier to entry (compared to Jamf), IDP password sync and great UI. \n\nNote if you decide to do an IDP password sync I'd advise to not cycle your passwords every x amount of time.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-02 21:57:27",
        "upvotes": 2
    },
    {
        "author": "sudo_brandon",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2zwxh0/",
        "body": "We \"evaluting\" Kandji as a \"cost saving\"... and by we it's the royal we.  I'm a long time Jamf Pro admin (since Casper).  Yes there is a learning curve but the community resources here and on Slack are a huge benefit.  With Jamf Pro you get the fine controls that Kandji does not offer.  Advanced Searches with email schedules, Smart Groups (worth every dime) and Extension Attributes allow for workflows and automation, and huge list of API commands.  I would not be able to do my job as efficiently on Kandji.  I am constantly pulled into Security meetings to help identify and remediate vulnerabilities in our computers.  Using Extension Attributues to identify subjects, Smart Groups as the target of custom policies that deliver a remediation script or package, all automated and reported is just not do able in Kandji.  Jamf Pro crushes it every time.\n\nIf you are a small organization of less than 100 then okay I can see the use case for Kandji but you get what you pay for.  \n\nWatch this video from Rocketman covering their review of Kandji vs. Jamf Pro. https://youtu.be/XQJelQ7Qttg?si=mTYyAM_3SZs4CKP4",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-05-07 16:05:34",
        "upvotes": 2
    },
    {
        "author": "Transmutagen",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2dh61r/",
        "body": "I do a full reimage of 300+ macOS computers once a year by myself with Jamf. I also manage them the rest of the year. I’ve looked into Kandji and it would take a lot more effort for me to do the same work with the same degree of granularity and customization.\n\nI guess if you’re a novice and just getting started managing Macs Kandji would make sense, but for me there’s just no substitute for Jamf.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-05-03 09:33:35",
        "upvotes": 3
    },
    {
        "author": "National-Concern480",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2aizsm/",
        "body": "Cost, we want to add Jamf connect and it's expansive as hell, (we just want to sync passwords, we don't need their zero trust solution)",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-05-02 19:41:27",
        "upvotes": 2
    },
    {
        "author": "National-Concern480",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2dk076/",
        "body": "we are eploring the options due to cost. and the offering of MDM and Passport for rugghly the same price that jamf asks only for Jamf Pro is tempting",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-03 10:07:13",
        "upvotes": 1
    },
    {
        "author": "The_Real_Meme_Lord_",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l29g350/",
        "body": "Overall ease of use. The UI is well thought out, functionality is refined and they continue to make monthly improvements that make my job easier. Their support is also amazing and fast, I often chat in to the same support reps so we know each other by name at this point. I found myself having to create scripts and config profiles to bridge the out of the box functionality of JAMF but the Kandji team has designed their product to just work and if it doesn’t most of the time it will remediate on next check in. \n\nA great example of this was FileVault. In JAMF, I had constant issues enabling file vault and escrowing the key up to the server. I remember JAMF support sending me a GitHub script to help make it work and not even that solved the issues. Kandji this functionality worked out of the box and as expected every single time.\n\nI did lose some detailed information like I can’t see how long users use certain apps for and other small reporting features but we could easily install something to bridge that functionality if we needed. \n\nIt just works and it’s very easy to use.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-02 16:04:38",
        "upvotes": 7
    },
    {
        "author": "elightcap",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2b9ejj/",
        "body": "We’re using module and it’s pretty ok. Some of the processes are a little annoying, and it doesn’t integrate with okta as well as jamf yet, but they do keep adding new stuff and the cost makes any pains more than bearable.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-02 22:15:45",
        "upvotes": 2
    },
    {
        "author": "RParkerMU",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2le9gs/",
        "body": "They flat out don't support EAs. There are adding some functionality for scoping, but it wasn't nearly as granular as Jamf Pro.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-05-04 20:23:04",
        "upvotes": 1
    },
    {
        "author": "cjducasse",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l28i2v8/",
        "body": "We explored this not too long ago, it came down to the effort of moving 400 Mac’s and 5000 mobile devices all needed to be wiped and re-configuring them was a rather large undertaking and not worth… saving exactly $0 because they were reluctant to match our pricing from JAMF. Mind you these devices are spread out across the lower 48 states.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-05-02 12:33:51",
        "upvotes": 0
    },
    {
        "author": "occupy_voting_booth",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2b0e0y/",
        "body": "What’s the price difference? We are higher ed and jamf is really cheap.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-02 21:20:40",
        "upvotes": 2
    },
    {
        "author": "Transmutagen",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2ecfic/",
        "body": "I've been working with Jamf for almost 20 years now, so I'm used to the workflow and how the pieces fit together to get what I want done. The basic building blocks of extension attributes, smart groups, policies, packages, scripts, and configuration profiles are like another programming language for me. The API is also critical to how I manage my devices/computers.\n\nLooking at Kandji I see a lot of the same functionality, but there's a lot more focus on the additional tools that sit on top of that base layer of building blocks. The built-in App deployments, OS Updates, Reporting, and Compliance Mapping look to be really awesome, with the caveat that if how Kandji does it isn't 100% how you want it done you will have to jump through some serious hoops to get what you want. Kandji is more of a \"it just works\" solution - and I'm well past that. I prefer a \"I can make it work EXACTLY the way I want it to\" solution, and for me, that's Jamf Pro.\n\nI'm not knocking Kandji - it's a GREAT solution, and more affordable than Jamf Pro by far. I was just jumping in here in response to the claim that:\n\n>I did the deployment alone for a 400 user company and I feel that would never happen with Jamf.\n\nDifferent tools for different use cases. That's all.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-05-03 13:54:40",
        "upvotes": 2
    },
    {
        "author": "MDMMAM_Man",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/ll3tbnw/",
        "body": "Intune is great for iOS and iPadOS but Jamf is still the leader for MacOS. 300 Macs is a decent fleet and the extra’s in Jamf will make your admin life easier and users will get a better experience.  I believe Intune will get there but back to back there are still some differences. Support from Jamf is really good and I always get good feedback back from their engineers.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-09-02 05:42:45",
        "upvotes": 21
    },
    {
        "author": "hickto87",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/ll3y949/",
        "body": "Having used both Intune and Jamf a lot, I would always pick Jamf for iOS/MacOS if budget allows. Intune doesn't come close right now for iOS/MacOS",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-09-02 06:31:39",
        "upvotes": 6
    },
    {
        "author": "CrazyInspection7199",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/ll6k4ug/",
        "body": "I haven’t managed Apple devices on Intune much, but I have on Jamf. Jamf is great but expensive. We moved away from Jamf recently over to Addigy and it’s been amazing. Their pricing is very competitive, and the ease of use, Knowledge Base, and Support is amazing.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-02 18:10:37",
        "upvotes": 1
    },
    {
        "author": "Many_Plan_936",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/lljqjeh/",
        "body": "JAMF is the Cadillac option, and it’s what Apple pushes in house. That said, you really pay for the privilege. \n\nThe real question is what features do you need. If it’s a vanilla setup with common apps, and users are empowered to do things like add their own printers with AirPrint; InTune is just fine.  You can add extras like XCreds or JAMF Connect to enable IdP login + LAPs and you’re good to go. \n\nIf you need to heavily curate the user experience, that’s where JAMF is worth the money. Zero touch OS upgrades, printer driver install and setup on demand, unique app deployment scenarios; all of that is easier with JAMF. Easier in the end, but it trashes a lot of time dialing it in. \n\nI have a large institution where we manage a fleet of nearly a thousand of Macs & iPads with JAMF. I have a smaller client that’s 50/50 Mac and PC; we do that all within InTune. \n\nIf you’re already an M365 shop, try InTune first IMO. JAMF will always be there to take your money if you want to make the jump. 🤪",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "created": "2024-09-04 23:38:48",
        "upvotes": 1
    },
    {
        "author": "Rocketman-Tech",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la7s89z/",
        "body": "Here's my main advice: \n\nMac Computers: Intune is okay IF you don't currently have management and you want to do something that is \"good enough\" - but Intune doesn't compete with other MDMs (like Jamf Pro) built specifically for the Apple platform. Mac really feels like a side note for them. I will also note that Jamf Pro has some amazing integrations with Intune, so using BOTH platforms is actually the best.\n\niOS devices: InTune is a bit better for iOS. However, one of the major drawbacks is that it takes 8 - 24 HOURS to send any MDM command, where as Jamf Pro (and most other MDMs) will take less than 1 MINUTE.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-06-25 15:09:24",
        "upvotes": 12
    },
    {
        "author": "Rocketman_Hugonaut",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la8az8y/",
        "body": "u/drosse1meyer Jamf provides a solution, their solution is \"Jamf Connect\" - this allows you to integrate Azure/Entra SSO with Jamf. When your device is enrolled into Jamf (including for the first time ever without anyone ever logging in) - Jamfs Connect login window will allow a user to sign in with their Azure/Entra credentials, the account will be created on the Mac & sync with Azure/Entra for password changes.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-06-25 16:53:39",
        "upvotes": 3
    },
    {
        "author": "Rocketman_Hugonaut",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la9xzp3/",
        "body": "Definitely a \"walled-garden\" scenario. I would draw the line at Security. Jamf offers iOS management & security that far exceeds anything Google Workspace is capable of for an iOS device. Both BYOD & Company Owned work incredible well side by side in Jamfs environment taking advantage of app/data compartmentalization for Corporate/Personal apps. If you are ONLY using Googles suite of apps then by all means, Googles Workspace would be the answer, but the moment you step out of Googles Purview, Google Workspace pales in comparison to Jamf.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-06-25 22:19:05",
        "upvotes": 2
    },
    {
        "author": "techy_support",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/labm2y0/",
        "body": ">iOS devices: InTune is a bit better for iOS. However, one of the major drawbacks is that it takes 8 - 24 HOURS to send any MDM command, where as Jamf Pro (and most other MDMs) will take less than 1 MINUTE.\n\nAs someone who has extensive experience with both JAMF Pro and Intune (my previous job was managing almost 30k iPads and 2k Macs with JAMF Pro; my current job is managing a much smaller fleet with Intune), I would vote that JAMF Pro *far* surpasses Intune for iOS and iPadOS (plus macOS, of course) in terms of usability, flexibility, granularity, and reporting, especially as your fleet size increases.\n\n*HOWEVER*, the idea that Intune takes \"8-24 hours to send any MDM command\" is not accurate in the slightest, at least for Apple devices (Windows devices are a different ballgame). Make the change in Intune, wait maybe 1-2 minutes, sync the device, and it happens fast...just like in JAMF Pro. It's all built on APNS just like all the other Apple MDMs. The difference is in the *reporting speed*. JAMF Pro updates it's reports much, much faster than Intune, which can take a few minutes (example: a script that Intune deploys to a Mac might *run* quickly, but the report showing that it ran might take awhile to show up in Intune).\n\nPart of Intune's issues (for macOS) is lack of good documentation about how it works behind the scenes on the device, and where to go for troubleshooting. I've found a few \"gotchas\" that just aren't documented anywhere I can find, and I only discovered them through trial and error. \n\n* Example 1: the limitation on line length for shell scripts. [Microsoft's documentation](https://learn.microsoft.com/en-us/mem/intune/apps/macos-shell-scripts) shows a 200KB file size limit but doesn't speak of a *line limit* for scripts. There didn't used to be a line limit that I could tell, but one day awhile back a 2,500 line shell script I was running on all my Macs stopped running, and I discovered through some troubleshooting that Microsoft had imposed  a line limit of ~1,200 lines. I can't find that documented *anywhere*. I had to completely rewrite that script and make a second script as a workaround for it due to that limitation (which wasn't communicated to Intune admins, nor was it documented).\n\n* Example 2: Microsoft's documentation doesn't tell you where they store the local logs for Intune on Macs (if you're curious, they're under /Library/Logs/Microsoft/Intune). They don't also tell you that if you try to sync your Mac to Intune too soon after another sync, Company Portal will *say* it successfully synced, but the actual log file says *\"Not enough time has passed since last check-in; adjusting check-in request.\"* and then doesn't really do anything. It's best to wait about 5 minutes between syncing your Mac with Intune so it will do a full sync instead of just gaslighting you into thinking it synced, when it didn't. Lastly, they don't tell you that the only real way to figure out which policies are running on the Mac (when looking at the local Intune log) is to find the policy ID for the script you want to check in the *URL for the script in Intune*, then search for that policy ID in the Intune log locally on the Mac.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-06-26 05:24:07",
        "upvotes": 4
    },
    {
        "author": "TheAnniCake",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la7zax7/",
        "body": "What bothers me most with Intune is the „speed“. Almost every other MDM managed to instantly check the device in and apply new configs within seconds. Intune can take hours.\n\nOverall, the config templates don’t really cover much but if you can script whatever you need to do, it’s doable.\n\nJamf also has their extension attributes which are a huge advantage in my eyes. Sadly some customers don’t see this the same way. Group creation alone is so much more dynamic with this. Intune‘s groups are.. bad in comparison. Hardly any really usable attributes and as of now I haven’t found any way of using something like EA.\n\nFor a „free“ product it’s certainly not bad. For mobile devices it’s become fairly good, but I‘d never recommend using it for macs.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-06-25 15:49:06",
        "upvotes": 1
    },
    {
        "author": "Rocketman-Tech",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la7xw6z/",
        "body": "Yeah the price is normally the same, especially for new clients, but I've seen old clients that are still grandfathered into the old pricing, which is crazy, because Jamf changed their pricing model in 2017!",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-06-25 15:41:15",
        "upvotes": 2
    },
    {
        "author": "raviyadav432",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktrqfqd/",
        "body": "Migrated from JAMF to Intune 2 years back and since then struggling.\n\nDevice Inventory doesn't have location information.\n\nYou can't modify checkin time which is 8 hours cycle. Forced checkin do nothing except inventory collection. Scripts only run when 8 hour checkin cycle is completed.\n\nScripts execution is unreliable on Intune.\n\nCustom packages were not supported earlier but now Intune has a macOS Package policy as only required deployment. Still have detection rule issues. MS Support has no clue whats the problem. Support ticket is open for last 2 months.\n\nCompany Portal self help has unreliable interface. Once you click \"Install\" any software, it takes very long to appear if something is installing or not.\n\nCustom scripts can't be deployed to Company Portal so that users can directly run on their Macs.\n\nNo Printers support\n\nNo option to flush Scripts/Apps logs except remove the policy completely.\n\nNo Smart Group kind of option. In JAMF, whole deployment was automated with the help of Smart Group.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-03-07 14:30:30",
        "upvotes": 23
    },
    {
        "author": "Toasty_Grande",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktrk89j/",
        "body": "Don't do it.  Intune with Macs \"works\" but it's far more labor intensive to get even close to the baseline features in JAMF.  The lack of smartgroups and patch management are just two of many items, and if JAMF ever jumped into the Windows management area, I'd drop Intune in an instant.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-03-07 13:49:32",
        "upvotes": 5
    },
    {
        "author": "RefrigeratorFancy730",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktrn1rc/",
        "body": "I haven't used Jamf in abt 2 years now and used it strictly for MacOS and iOS. hat I remember SmartGroups were really cool, and are more flexible than AAD dynamic groups. Being able to create smart groups based on devices that have 'XYZ' installed is way ahead of anything Intune has standalone at the moment.\n\nJamf has the ability to create groupings in the software GUI so you can expand and collapse categories. The reporting was easier and more intuitive.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-07 14:08:34",
        "upvotes": 2
    },
    {
        "author": "Deleted",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/kts6zyk/",
        "body": "We have both JAMF and Intune and given that Apple has a better relationship with JAMF than Microsoft, we just tied JAMF and Intune together rather than switch entirely to Intune exclusively.\n\nYes, it does cost more but we have all the control we still want until Intune matures more (and if Apple will allow Intune more integration if ever).",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-07 16:07:43",
        "upvotes": 2
    },
    {
        "author": "AlaskanAvalanche",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktupmu7/",
        "body": "I would avoid it if you can… if you like JAMF.  I’m the PC guy at my school district and I actively push our windows devices to be replaced by MacBooks because JAMF is that much better, especially for Macs.  Anytime I go from using JAMF back to Intune I cry on the inside on how good Intune should be.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-03-08 01:34:12",
        "upvotes": 1
    },
    {
        "author": "MacAdminInTraning",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktvgkf0/",
        "body": "Generally speaking, don’t. Intune Mac management is garbage and a lot more hands on then Jamf Pro managing Mac’s. You can google specifics if you are interested but it’s safe to say Intune is about a decade behind Jamf.\n\nOh if no one mentioned it. Microsoft uses Jamf to manage their Mac’s, not Intune. That should tell you a lot about the quality of Intune.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-08 04:37:50",
        "upvotes": 1
    },
    {
        "author": "Deleted",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktviq6k/",
        "body": "I mean up until Q4 2023 or so, Intune didn’t have this capability. It does now, and this was a big advantage that Jamf had over Intune.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-08 04:54:42",
        "upvotes": 2
    },
    {
        "author": "ResponseThick751",
        "url": "https://reddit.com/r/jamf/comments/1eb47h0/jamf_enterprise_administrators/lf2cq5x/",
        "body": "Just me. 2.2k mixed between iPads, Macs, and AppleTV's. Not to mention the other 5k+ chrome devices that we as a team manage. Jamf setup takes a hot second, but the maintenance, management, and deployment is a piece of cake once setup. I have another guy who can assign profiles and users to enroll Macs when they come into the shop and need wiped, but he isn't familiar with the creation of the profiles, device groups, account settings, etc. We also have a break glass admin account with all privileges.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "created": "2024-07-26 17:34:37",
        "upvotes": 1
    },
    {
        "author": "Thecrawsome",
        "url": "https://reddit.com/r/macsysadmin/comments/1emlamm/jamf_for_small_amount_of_macs_and_apple_products/lh1zcyj/",
        "body": "I've used it for 2 years. Biggest issue is the ADE token unexpectedly expires and some machines don't enroll in MDM. Refresh token and ask them to reboot when this happens.\n\nNot as good as JAMF but cheaper.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-08 03:51:27",
        "upvotes": 2
    },
    {
        "author": "excoriator",
        "url": "https://reddit.com/r/macsysadmin/comments/1be2sl8/jamf_vs_intune/kuqqkos/",
        "body": "Price is the biggest benefit of Intune, if your enterprise has a license that includes it. We’re a Jamf shop that may use it for lightweight management of BYOD devices.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-03-13 21:46:38",
        "upvotes": 5
    },
    {
        "author": "deramirez25",
        "url": "https://reddit.com/r/macsysadmin/comments/1be2sl8/jamf_vs_intune/kurs3tq/",
        "body": "Because we have Intune licenses already available. And jamf cloud is more expensive than our current onprem. Plus I been advocating to not go cloud of there's an onprem option available.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-03-14 01:31:49",
        "upvotes": 3
    },
    {
        "author": "InformalPlankton8593",
        "url": "https://reddit.com/r/macsysadmin/comments/1be2sl8/jamf_vs_intune/ley7h5l/",
        "body": "We were looking to save cost of Jamf and to get compliant devices easier than the connector that Jamf has. It was an unenroll re-enroll process for 90% of the machines. The only devices that were wiped, were a few that were never in Apple Business. Those devices were manually added to Apple Business and then then went through ADE. Overall it went very smooth. Almost 100 device migrated in about 30 days or so.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-07-25 23:06:08",
        "upvotes": 1
    },
    {
        "author": "Showhbk",
        "url": "https://reddit.com/r/macsysadmin/comments/1dy6fzj/is_there_any_way_around_this_with_a_jamf/lc85jp9/",
        "body": "You can create a profile from within JAMF to allow the Developer ID and Bundle ID access to record the screen. You may need to read documentation from JAMF depending on if you use School or Pro. I have to do this all the time to silently install applications and grant them permissions. \n\nEnter each of these into a Terminal window that has Administrative access. \n\n    Developer ID: codesign -dvvv /path/to/application.app\n \n    Bundle ID: defaults read /path/to/application.app/Contents/Info CFBundleIdentifier",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-07-08 18:00:33",
        "upvotes": 1
    },
    {
        "author": "Greedy_Chocolate_681",
        "url": "https://reddit.com/r/Intune/comments/1g4z0id/jamf_vs_intune_for_macos/ls7x1s6/",
        "body": "We tried to move from Jamf to kandji and found the product impossible to use, all of the sales promises vaporware, and support was quite unresponsive/unhelpful.  0/10 would not recommend.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2024-10-16 16:06:19",
        "upvotes": 1
    },
    {
        "author": "Sea-String7303",
        "url": "https://reddit.com/r/jamf/comments/1f69eop/scripts_using_jamf/ll19wz3/",
        "body": "I’m on JAMF school. It’s affordable being that $9 per device per year. What I meant by saving money is not hiring an expert and trying to manage devices on my own.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-01 19:29:41",
        "upvotes": 2
    },
    {
        "author": "MacAdminInTraning",
        "url": "https://reddit.com/r/macsysadmin/comments/1d77w8d/update_os_trough_jamfpro/l6yf1pi/",
        "body": "You can only manage OS updates through MDM. JAMF has the MDM and DDM commands for OS updates on the left side bar. \n\nApples management of OS updates leaves a lot to be desired. \n\nTools like nudge and Superman are fine for user notifications, but they do nothing more than notify the user. If the user does not elect to install the update manually, those tools cannot force the device to update and due to that are not really worth the headache in configuration anymore.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-06-03 19:24:15",
        "upvotes": -1
    },
    {
        "author": "gandalf239",
        "url": "https://reddit.com/r/macsysadmin/comments/18rfw2m/is_there_a_free_alternative_of_jamf/kf214t3/",
        "body": "As others have said, Jamf Now is free for up to 3 devices, with additional devices costing $4/mo. No minimums apply.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2023-12-27 00:15:00",
        "upvotes": 3
    },
    {
        "author": "omerninyo",
        "url": "https://reddit.com/r/macsysadmin/comments/18rfw2m/is_there_a_free_alternative_of_jamf/kf8d7yi/",
        "body": "Jamf now in the free tier (and 4$ per device later) includes Jamf connect for password syncing (Okta and Entra ID only) AND Jamf Protect for basic malware protection.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2023-12-28 05:44:03",
        "upvotes": 1
    },
    {
        "author": "MrTipps",
        "url": "https://reddit.com/r/macsysadmin/comments/1dwthki/is_jamf_now_worth_it_for_an_smb_now_that_there_is/lbx6ayc/",
        "body": "5 seats is like the sweet spot for Jamf Now, considering the first 3 devices are free. At 25, you may as well move to Mosyle or Jamf Pro.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-07-06 17:35:04",
        "upvotes": 9
    },
    {
        "author": "theitguy1969",
        "url": "https://reddit.com/r/jamf/comments/1e67nu7/jamf_connect_worth_it/lds1l2t/",
        "body": "We went from devices being bound to AD (which you never want to do!) to Jamf connect. I absolutely recommend it!  Yes your users will have 2 logins, 1st one being unlocking filevault drive and second will be the Azure log in. Jamf connect keeps the Azure password in sync with the local account password so the user doesnt have to manage multiple passwords.  I cant image what your current management is for accounts on devices right now.  Its especially slick on Zero touch deployments ,it will create the local account on 1st login  to a device.  but as long as the users just put their device to sleep or set up a fingerprint , the only time they really need to log in twice is after a reboot.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-07-18 14:45:11",
        "upvotes": 4
    },
    {
        "title": "why is JAMF 200 cost so much?",
        "author": "hellsbellltrudy",
        "url": "https://www.reddit.com/r/jamf/comments/1drp43u/why_is_jamf_200_cost_so_much/",
        "body": "Jumping from the Jamf 100 cert from $100 to $2500 is insane!",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "subreddit": "jamf",
        "created": "2024-06-30 00:25:30",
        "upvotes": 0
    },
    {
        "author": "MacBook_Fan",
        "url": "https://reddit.com/r/jamf/comments/1f3er5q/jamf_connect_password_sync_for_microsoft_active/lkde3jh/",
        "body": "You can not push the AD/AAD password to the Mac. There is no way for Jamf Connect to obtain that password. If the user is logged in to their Mac when the password is changed, then Jamf Connect will notify the user to update their password in Jamf Connect and then provide their old macOS password to change it to the new password. \n\nIf the user is not logged in, they can either log in with their old password or you will need to have the user boot to recovery and help them change their local password to match their new AAD password.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-28 17:19:01",
        "upvotes": 6
    },
    {
        "author": "staze",
        "url": "https://reddit.com/r/macsysadmin/comments/ypqsdg/jamf_support_is_terrible/ivpucpe/",
        "body": "Been a jamf admin for a long time at this point... can definitely say their support got hit when they switched to ServiceNow. It's since recovered a bit. Our sales rep admitted this. They also had a pretty big dip in support levels when they went public (around the time they stopped having \"Buddies\"). \n\nThat said, we complained to our sales rep and filled out a scathing survey when they sent us a \"please review jamf\". Since then our support has been much better... but could be coincidence. \n\nI've recently opened several tickets with them and gotten decent responses. Honestly my biggest frustration is how long it takes them to implement features or fix known issues. We've complained many times that they seem more focused on Jamf Protect, Jamf Connect, etc than their core Jamf Pro product. They of course argue this, but before 10.42, it's been a while since we'd seen a significant release. =(",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2022-11-09 19:02:43",
        "upvotes": 3
    },
    {
        "author": "southpawbrewer",
        "url": "https://reddit.com/r/macsysadmin/comments/ypqsdg/jamf_support_is_terrible/ivkrahe/",
        "body": "Nice try, Jamf marketing guy. Jamf's lack of solid support is 100% of the reason we switched to Mosyle and haven't looked back.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "1",
        "created": "2022-11-08 18:10:27",
        "upvotes": -1
    },
    {
        "author": "nancybatespro",
        "url": "https://reddit.com/r/jamf/comments/1fiz09u/im_new_to_jamf_and_the_mac_environmenthow_do_i/lnm6aqi/",
        "body": "To fully unmanage a MacBook in Jamf Pro, you need to do a few more steps. After removing the MDM profile and wiping the computer, make sure you also remove the device from the Jamf inventory. Go to \"Computers,\" find the device, and click \"Delete\" to remove it entirely from Jamf. If it's still in the inventory, it’ll re-enroll when it connects to Wi-Fi. And, make sure the MacBook isn't listed under any automated device enrollment settings like Apple Business Manager, which could be pushing the profiles back.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-17 19:03:39",
        "upvotes": 2
    },
    {
        "author": "Hotdog453",
        "url": "https://reddit.com/r/sysadmin/comments/mb4pmf/does_jamf_think_were_idiots/grwv8qy/",
        "body": "We're a Fortune 15, and have \\~2500 Macs, and \\~42k Windows devices. We use JAMF. We like it. The pricing stuff is about in line too, if you really do the math. This line though, is just silly and weird.\n\n> On the contrary, Windows 10 requires enterprise organizations to either add these features, purchase the “Pro” version, or both. [Microsoft sells Windows 10 Pro for $199.](https://www.jamf.com/resources/white-papers/migration-cost-comparison-windows-10-versus-macos/) The Pro version is required to bind a PC to your domain and to get full disk encryption (called BitLocker). Additionally, most organizations add antivirus software on top of Windows to protect against malware and viruses that have plagued and continue to plague PCs. \n\nLike... no one does that. That makes no sense, and everyone \"IT\" related knows that's true. That's not how licenses are bought in the Enterprise, at all.\n\nMac's are also a self-selecting group; if you want a Mac, you want a Mac. So your userbase, by design, likes and understands their platform. The Windows platform is 'understood', sure, but a lot of people don't give a shit, so they have no vested interest in the platform.\n\nTheir numbers are 'right', and as mentioned before, if you only have like... 5 Mac's, then you view them as a challenge, and not a platform.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2021-03-23 10:09:14",
        "upvotes": 43
    },
    {
        "author": "cjcox4",
        "url": "https://reddit.com/r/sysadmin/comments/mb4pmf/does_jamf_think_were_idiots/grvz91k/",
        "body": "Yeah, the JAMF cost box should be at least 3x taller than it is too.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2021-03-23 02:59:44",
        "upvotes": 13
    },
    {
        "author": "handsomemagenta",
        "url": "https://reddit.com/r/sysadmin/comments/mb4pmf/does_jamf_think_were_idiots/grxtg0b/",
        "body": "Agreed. We’re in the 90% range of Macs deployed with some PCs sprinkled in. I’ve been a Jamf SME for over a decade and can tell you the product has become better and has made our lives easier to manage. Trying to learn Endpoint Manager is a bit of a learning curve but slowly noticing the parallel setups and configs needed.\n\nThe alternatives to Jamf are out there, it’s just Jamf has a longer road to build their product on. It was an answer to Apple not being “enterprise” friendly. They’ve also added resources to the company to grow them globally. \n\nI would say Jamf makes it easier for admins and end users to use Macs.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2021-03-23 15:35:48",
        "upvotes": 2
    },
    {
        "author": "Dazed1",
        "url": "https://reddit.com/r/macsysadmin/comments/1e08ffh/thoughts_on_jamf_protect/lclqedo/",
        "body": "We use it on ~1,100 endpoints. It rarely hits on anything. The ability to block execution of software by bundle ID or team ID is handy. The CIS benchmarks are a neat feature as well. We get a bundle deal on it along with Jamf Pro and Connect. The best part is probably how easy it is to deploy as there is a built-in integration with Jamf Pro to deploy everything needed. It also has probably the best day-1 support for new macOS versions out of any EDR. Even SentinelOne, etc has had compatibility issues where they are scrambling to patch something that broke due to an update or major OS release. I don’t know how it stacks up as far as MITRE evaluations against other EDR products but I’m pretty happy with it. S1 is a bit more work to deploy and maintain. Not that it isn’t worth it. We run both on a couple VIP endpoints.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "created": "2024-07-11 00:50:48",
        "upvotes": 5
    },
    {
        "author": "EnricoDandoloThaDOV",
        "url": "https://reddit.com/r/macsysadmin/comments/1e08ffh/thoughts_on_jamf_protect/lcpbkzp/",
        "body": "Currently using it in our environment of ~5000 devices. A few takeaways:\n\n- pretty easy to deploy. Basically a .app package with a configuration profile. Syncing plans with your Jamf Pro Server is also a nice way to keep the various Plan configurations you make up to date. \n- Analytics is a pretty powerful feature. Takes some investment in learning how to write queries (this is also changing soon), but once you know how to do it there's a lot you can do with it.\n- the Jamf Security Cloud portion has a slightly harder configuration, because it a bit confusing on how to actually get the data from your endpoints that you want. \n- works best when you have a dedicated SIEM tool you're already using. Data Forwarding sources are pretty flexible for sending Telemetry Data, but they really intend for you to do a lot of analysis of events outside of the Mac Security Portal.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "created": "2024-07-11 17:17:10",
        "upvotes": 3
    },
    {
        "author": "ChiefBroady",
        "url": "https://reddit.com/r/macsysadmin/comments/1fhju8c/intune_mac_admin_wants_to_become_jamf_admin/lnbmsi8/",
        "body": "You’ll have to pick up the ice a bit. Jamf is much quicker in everything as compared to intune.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-15 22:35:02",
        "upvotes": 2
    },
    {
        "author": "Krayge",
        "url": "https://reddit.com/r/jamf/comments/1fqo35n/jamf_200/lpiegwb/",
        "body": "Recently bought an annual pass and cleared the 200, 300, and 370. It's been a fantastic experience. Money well spent. If you're going to pay $2500 for one course, I'd say pay an extra $2000 for all of them. Being fully certified will set you apart from others on a CV for employers seeking Jamf expertise and the courses are very high quality.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-09-29 16:22:31",
        "upvotes": 1
    },
    {
        "author": "MikaelDez",
        "url": "https://reddit.com/r/macsysadmin/comments/199xtu4/why_is_sentinelone_better_than_jamf_protect/kikr5bw/",
        "body": "I’m surprised to read your experience with Jamf, it’s honestly made my job easier and it’s made my Mac environment super stable and easy to manage. Granted I haven’t tried alternatives, but I really couldn’t see how any other MDM would dethrone Jamf for me unless they had actual solutions that Jamf couldn’t solve",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-01-19 11:52:25",
        "upvotes": 2
    },
    {
        "author": "MikaelDez",
        "title":"What is the future of Jamf? I got an offer as a Jamf administrator. Should I accept?",
        "url": "https://qr.ae/p2ZQHa",
        "body": "Thanks for your question. I think Jamf is a solid player in the mobile device management (MDM) and Mac management space. The company has a historic relationship with Apple Field Engineering and is used by Apple internally to manage Apple Retail Store devices. Their support teams have historically been very good, industry leading, but they do have some struggles due to being a bootstrapped company (started in 2002, VC acquisition in 2017, IPO 2020).\n\nIMO there is questionable leadership and they continually access consultants to support their operations, which is common for a large, complex organization. They also struggle with diversity and inclusion, which has become more important in recent years for financial and operational success. The quality of their software and support has slipped over the years due to these recent changes, which enables them to stay current with the market.\n\nWith Fleetsmith being acquired by Apple, versus Jamf, I think the writing is on the wall. Historically companies that are acquired tend to implode, however Jamf went IPO in 2020. It remains a modern tool for Apple device management.",
        "platform": "Quora",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "created": "2024-01-19 11:52:25",
        "upvotes": 2
    },
    {
        "author": "MikaelDez",
        "title":"Jamf Didn’t Meet Our Needs in Fintech",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "As an IT Manager for a fintech company with 5,000+ employees, we implemented Jamf hoping it would streamline device management, remote support, and patching. Unfortunately, it didn’t meet the demands of our environment.\n\nThe remote assistance tools were slow and unreliable, with frequent connection drops during sessionsfrustrating for both IT and end-users. Patch management was inconsistent, with some critical updates failing to apply automatically, requiring manual intervention. The inability to schedule patches flexibly across time zones also disrupted our global workforce.\n\nWhile Jamf offers a lot of features, the learning curve was steep. Even my experienced team needed weeks to get comfortable, and documentation wasn’t easy to navigate in urgent situations. Scalability was another issue, as bulk actions failed randomly without clear error messages, slowing down operations. The reporting tools were too basic for the compliance requirements we need in fintech.\n\nJamf may work for smaller companies, but for large, compliance-heavy environments, it didn’t deliver. We’re already exploring alternatives that offer more reliable patching, better remote support, and smoother scaling.",
        "platform": "Quora",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-05-02 11:52:25",
        "upvotes": 7
    },
    {
        "author": "MikaelDez",
        "title":"Jamf: Great Features, but Lacking in Customer Support",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "I’ve been using Jamf for our IT management needs for a while now, and while it has some great features, I've encountered several challenges that make me question its overall value.\n\nFirst off, the customer support has been hit or miss. When we initially set up the system, it took a long time to get a response to our queries. I expected more prompt assistance, especially given the complexity of the platform. When we finally got through, the support team didn’t always have the answers we needed, leading to frustrating back-and-forth communications.\n\nThe patch management system is another area that could use improvement. Although it offers automation, we frequently experience issues where updates fail to install as planned. This leads to extra manual work and concerns about keeping our devices secure.\n\nAdditionally, the remote support functionality can be unreliable. Connection drops and lag during sessions make it difficult for our team to assist users effectively. When you rely on tech support, these delays can lead to significant downtime.\n\nLastly, the user interface feels a bit outdated and cluttered. It can be challenging to navigate, even for experienced team members. The documentation could also use a refresh; it often lacks the clarity needed during critical moments.\n\nOverall, while Jamf has promising features, the lack of reliable customer support and some functional shortcomings make it tough for us to fully endorse it. We're considering other options that might better meet our needs.",
        "platform": "Quora",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-02-24 11:52:25",
        "upvotes": 5
    },
    {
        "author": "MikaelDez",
        "title":"Jamf: A Disappointment in Every Way",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "Being the head of IT of my organization, I rarely write reviews, but I felt compelled to share my experience with Jamf, and frankly, it’s been a nightmare. This platform is a glorified mess!\n\nFirst off, the remote assistance tools are a joke. Sessions constantly drop, and the lag is so bad that you’d think we were using dial-up internet. It's infuriating trying to help users when the damn tool doesn’t work half the time.\nAnd don’t even get me started on the update management. I can’t tell you how many times critical updates failed to install. Seriously, how hard is it to get this right? It feels like they don’t care about security. We’re playing a game of whack-a-mole, trying to fix issues that shouldn’t exist in the first place.\n\nThe customer support is equally abysmal. When we reached out for help, it took forever to get a response, and when we finally did, the reps were less than helpful. Honestly, I felt like I was wasting my time.\n\nIf you’re considering Jamf, do yourself a favor and run in the opposite direction. It’s not worth the headaches and frustration. Save your sanity and look for a solution that actually works!",
        "platform": "Quora",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "created": "2024-07-14 11:52:25",
        "upvotes": 1
    },
    {
        "author": "rougegoat",
        "url": "https://reddit.com/r/macsysadmin/comments/199xtu4/why_is_sentinelone_better_than_jamf_protect/kiibaah/",
        "body": "I mean when the other giant name in MDM is only just now getting around to allowing you to run scripts and a package at the same time, it's hard for Jamf not to look great in comparison.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-01-18 23:11:36",
        "upvotes": 18
    },
    {
        "author": "oxidizingremnant",
        "url": "https://reddit.com/r/macsysadmin/comments/199xtu4/why_is_sentinelone_better_than_jamf_protect/kiq7n74/",
        "body": "FWIW, Kandji is much simpler to use than JAMF. No denying that JAMF has a lot of power but Kandji makes app deployment, device hardening, and patching simpler with one pane of glass vs 2-3 different portals for JAMF.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2024-01-20 11:52:29",
        "upvotes": 1
    },
    {
        "author": "981flacht6",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrw32l7/",
        "body": "You need 50 licenses to go to JAMF Pro but it's pretty great. Lot of resources available, support has always been solid. Mac Admins slack is the goat for Mac help.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2023-07-14 03:35:45",
        "upvotes": 2
    },
    {
        "author": "ZachVIA",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrwa21e/",
        "body": "Spend the extra money on JAMF Connect first of all. The most annoying things we have had to deal with in the hybrid JAMF/Intune environment is how to deal with our O365 conditional access bullshit. That can get hairy since you can’t fully manage Macs with JAMF and Intune at the same time (to be fair I’m not an expert on the subject).",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2023-07-14 04:41:45",
        "upvotes": 1
    },
    {
        "author": "Amells",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrwt3th/",
        "body": "Jamf is fine, but the integration of window AD isn't that great. You may need the jamf connect in the future if you get more Macs.\n\nThis is because MacOS doesn't allow any WiFi connection at the login session so users can't connect to a WiFi and login via their Azure ID on macos. This problem is getting worse on MacBooks which are supposed to be mobile. The alternative solution is creating a mobile account for the target user.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2023-07-14 08:30:07",
        "upvotes": 1
    },
    {
        "author": "hunterkll",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrvncbe/",
        "body": "I wouldn't use anything but JAMF, no matter how many machines. JAMF is #1 for a reason, and for small amounts of machines, very cheap. I'd peg intune as almost #2 at this point and it's not great. AirWatch etc can all go in a dumpster. The others just aren't feature complete. \n\n&#x200B;\n\nJAMF cloud is super easy to set up if you go that route, and if you need to do things like conditional access integration, JAMF cloud is the best and easiest route bar none.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2023-07-14 01:18:42",
        "upvotes": 10
    },
    {
        "author": "ZachVIA",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrw9ka2/",
        "body": "JAMF charges per machine, so it’s a great solution even for small implementations.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "created": "2023-07-14 04:36:58",
        "upvotes": 3
    },
    {
        "author": "HeLlAMeMeS123",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrvwog7/",
        "body": "We chose Jamf because of a few things, simplicity, price, and features.  We have an extensive list of config profiles.  The price was right.  We went with Jamf Pro, since we don’t manage our testing devices with Jamf.  It’s something like $7 per device.  We tested Apple business essentials, kandiji, and Jamf.  ABE was let feature rich enough, kandiji was too expensive.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2023-07-14 02:37:48",
        "upvotes": 3
    },
    {
        "author": "damienbarrett",
        "url": "https://reddit.com/r/macsysadmin/comments/1exsywb/prestage_enrollment_and_jamf_apps/lj8wr88/",
        "body": "Jamf may not tell you this, but there are some soft limitations to how much/how many pkg installers can be put into a PreStage. More than a certain size or amount and you start to see unusual and unpredictable behavior. The PreStage .pkg payload is meant for things like Jamf Connect and other IdP connectors. Best practices is to have your Application installations be part of an Enrollment policy chain with a custom trigger.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-08-21 18:03:36",
        "upvotes": 6
    },
    {
        "author": "ZeroDayMom",
        "url": "https://reddit.com/r/macsysadmin/comments/1f9sazr/password_policy_compliance_with_jamf_connect/llvcyu5/",
        "body": "When I deployed Connect, we actually had to remove the config profile because it interfered with the idp's password policy and users were getting errors. It was recommended to set password enforcement with the idp, not with Jamf. If Jamf is more strict than the idp, users will get password incorrect errors, even if it's correct. Idk if that's changed since then or not.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "1",
        "created": "2024-09-06 22:47:21",
        "upvotes": 2
    },
    {
        "title": "JAMF Pro has good support and training",
        "author": "Steven P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9717850",
        "body": "I really enjoy the support that we receive from our representative at JAMF. They give us a detailed meeting every month and go over any new features that maybe helpful to our company and ask us any new projects we are working on and any help they can offer. They have helped many times with projects when we get stuck or offer alternate solutions to things. I am also very pleased with the training classes for getting certified in JAMF. The instructors are very informative and know their stuff. It is great getting to meet other people in the class and finding out how they are using JAMF. I also very excited to get to attend JNUC in October to meet more people and see how they are using JAMF to manage their environments and to also learn about new features. I use JAMF on a daily basis to monitor our users mobile devices and help with the return of termed users equipment.The learning curve seemed a bit steep. It wasnt until I started taking the training that I was able to truely use the product in more consisive ways. I do wish the UI was a bit more user friendly... with the latest updates it did get better but I feel there is still some room for improvements.We are a fully remote company. We ship the users computers of which they need to setup themselves. JAMF has made it so we can do this with little stress to the user and ensure machines are properly setup from a security standpoint. It also enables us to be able to ensure we have a tool to get assets back from termed employees.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro",
        "author": "Matthew C.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9688478",
        "body": "Enrollment is very simple. There a lot of settings you can use during enrollment to get going, including adding pkgs that every MacBook needs. I love the amount of info that is collected on the devices and the ways to export and use the data. Keeping apps and OS updated is nice. It is easy to lock a device if needed. Pretty good community to ask questions when trying to learn. Jamf support is good. I have been involved with devices already enrolled and new devices coming in. Very easy to work with. I am in Jamf everyday checking on devices or finding devices that need some help. The new remote session is great to use! I has been easy to integrate with all of our schools. Implementing new features has been pretty smooth. There are a lot of settings, called policies or configuration profiles, that can be used to limit or not limit what the end user can do. I love that I can upload a list of devices that will then update fields in jamf, such as username, building, etc.Some of the things we have tried to implement can be difficult when you get down to a very small subset. Example, trying to figure out a specific set of commands to run in a script to work set up something. The scripting part can be difficult at times, but that is not Jamf's fault. The implementation of the script can be difficult. Again, most of that is not on Jamf. I wish there was better support for the scripting part. Every once in a while I will see a setting or menu area that does not seem logical. I wish there was a way to run commands on an iOS device like you can on a MacBook. There are times when you just need to run that command and you know it would fix it, but you cannot. Again, I think that is an Apple issue not Jamf. There are times when you want to have something run automatically through Jamf, but it is not as easy as clicking a check box. It can take a short amount of time to find someone that has done the same thing, but it could take a long time. In that regard, I should use Jamf support more.It is what we use to control all of our iPads and MacBooks for students and staff. Makes updating, adding apps and adding printers so much easier than having to touch 4000 devices in our organization.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro is the gold standard for Apple management",
        "author": "Cord T.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9687163",
        "body": "The best parts of Jamf Pro are, it is easy to use and figure out, it has great features and functionality, and their customer support and community. Becasue of the ease of use, the implementation went very smooth. For the features and functionality, you can accomplish just about anything with the basic features available to you. However, if you are not advanced, then that is where the community and customer support comes in. The community members almost always have an answer or a point of view to share. The customer support has always been quick and willing to help. Really enjoy the community they have built!Only dislikes are that I can't use it for everything! Windows and Linux would be cool to be supported, but at least Android for the MDM side of things.About 10% of our enviornment is macOS, so we are using Jamf to manage those computers. It is currently allowing us to implment security settings like CIS Benchmark Hardening, it is allowing us to deploy corporate software and remove potentially unwanted programs, it is allowing us to report and provide analytics to our various business units, and it is allowing us simply patching these computers.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro makes 1:1 school program effortless",
        "author": "Michael C.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-6597855",
        "body": "It is rather effortless to deploy and manage a fleet of 1,000 iPads at our school. My favorite feature is how easy it is to create and deploy a configuration profile and how well it is integrated with our on-premise Active Directory server.The app and book deployment process is very klunky. It is easy for me because I have done it literally hundreds of times. We restrict all apps except for some (what we make available on Self-Service). I have to then add the bundle ID into the configuration profile. It could be a lot easier to use. But it works. And it works WELL.If you manage IT in a school or business this tool is a MUST! Not comparable to other competitors. It is very easy to use and works so well. Support is great, they help even with silly questions.It is extremely beneficial to use in a school large or small. Apple TV management is a life saver. We have one in each classroom! I am getting into managing mac computers, so I am still trying to understand how that all works. Very complex software that allows you to really configure everything!!! Lots to learn.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro provides excellent customer support and has helped us improve our overall productivity.",
        "author": "Trevor L.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9629708",
        "body": "The platforms are feature rich, easy to use and are well designed while not overly cluttered with too many widgets. The main Jamf Pro dashboard is easy to customize and tailor to our specific needs.  Reports are packed with powerful and yet simplified data in a visual structure that is easy to read and understand for even the lay person.I have found that when looking for information it can be a bit of a fact finding mission, even though the documentation is really well written, it can be hard to locate it. The web generated reports are as beautifully crafted as they are, it is hard to utilize for offline reporting needed for presenting to board members. Since a lot of these wonderful reports are in web only format, possible relevant data for export seem to be very limited in scope. This also leaves us relying on third party tools and utilizing more user and financial resources to generate similar yet far less accurate reports.Since most of the organization is remote, remote administration is a critical feature to support managing of our devices remotely. It allows us to securely access and configure devices from a centralized location, reducing the need for on-site visits or manual intervention.\nEndpoint security is an importan issue and Jamf Pro ensures that all devices are protected against malware and other cyber threats, preventing unauthorized access and data breaches.\nIdentity management integration with Okta and Google provides users with an authenticated login to access our varying corporate infrastructure and prevents unauthorized users from accessing sensitive information.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Amazing experience, and easy to use",
        "author": "Jeremy H.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631022",
        "body": "Jamf Pro has made it extremely easy for a user like me, who does not have prior experience with Apple device management, to manage multiple Apple devices, from computers to iPads to Apple TVs. We started using Jamf Pro just to manage our Apple Computers, but have since added over 100 other devices which are super easy to manage as well. Using profile enrollments makes settign up new devices extremely simple. On top of all of this, Jamf Support is wonderful to work with, and always respond super quick.There is not much to dislike. My only wish is that you could add an Apple account to a device through Jamf Pro. This would make it easier for iPads and Apple TV's where we use the same Apple ID on them, and lock the devices in Single App Mode. Not having to manually log in on each of these devices would make the experience that much better.Jamf is making the management and deployment of our Apple fleet so much easier than it had been. It is also very reasonably priced, which helps in an economy where budgets are tight.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Easy to use and easy to maintain",
        "author": "Simon A.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630769",
        "body": "I like how easy it is to get going and make changes. You can be as advanced as you want or as simple as you want and things work either way. It has really helped us solve a lot of issues quickly that were happening when our devices were not managed properly.Most of the downsides we have are not even related to JAMF itself but more than likely our own enviroment and users. With that being said we do have an issue of devices losing contact with JAMF services and never being able to recover even though the show in the JAMF portal but a simple wipe which takes total time from wipe to user working is 30min for us so its not a huge issue.It allows us to deploy things to our remote users and in office users with ease and empower users to be self suffecient in a lot of areas as we just add things to self service or send a something via JAMF and it gets done in the background its great.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Robust system, great customer service",
        "author": "Sharon D.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630398",
        "body": "Jamf Pro makes it really easy for us to manage our iPads and MacBooks. The app catalog for MacBooks is especially helpful, so we don't have to package software as often. Being able to customize the way our devices enroll is also helpful. It integrates with Google, which means that our students and staff can have the same login information across the board. The more we learn about its capabilities, the more fine tuned we can be with our management, but even with our basic knowledge at the beginning we could set it up well enough to get things started. The best thing about Jamf, though, is the customer service team. They are diligent and helpful and quick to either find you a solution or find the right person to get you a solution.There are some features that they are lacking or are behind other MDMs in developing. It seems like between them and Mosyle, it's always a race to see who is going to implement what first and better. Mosyle was first to implement an app catalog and admin privilege requests, and their user interface looks a lot more user friendly than Jamf. Some aspects in Jamf, like configuration profiles, it can be difficult to know what settings mean without having a deep working knowledge of Apple's infrastructure. It would be nice if settings had a description of \"enabled means this\" and \"disabled means this\".It keeps our device management and asset database all in one place. We have one pane of glass for seeing our fleet of devices.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro great for One to One Apple Environments",
        "author": "Dylan A.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9499443",
        "body": "Jamf Pro's admin user interface is simplistic in use, but verbose in its capability. I am in it every day to monitor our Apple fleet. I enjoy Jamfs Training courses. I have been able to customize it to our organizations unique needs.We have had some issues in the past with Jamf's customer service. They boast same day support for Apple features/products, but I have not always found that to be the case.Our organization has almost 12 thousand Apple mobile devices and 2,200 Apple Computers to manage. Jamf Pro places that management all in one place for ease of setup and continued monitoring. We use some of Jamf's other products like Protect and Connect to easily manage all of these devices with seamless integration across Jamf products.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Easy and robust!",
        "author": "Jason P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-8060778",
        "body": "Jamf Pro makes managing our device fleet relatively easy. The interface is quick to navigate and intuitive making it a snap. Key fetures, such as Locate Device, remote wipe, inventory, IP address, last known loaction and a host of others make the infomation very useful.I fell that that navigating back to a search is a bit challenging. For example, if I search for a device by name, I can't just click the back button to go back to my search. I have to click the category and retype the number. Minor inconvenience.Jamf is allowing me to manage my entire Apple fleet from one place. This makes centralized management easy and convenient and allow us to be more productive and rollout changes, updates, and new programs quickly.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Jamf is a must have for any Apple centric organization",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9713216",
        "body": "One of the most powerful things about Jamf in my opinion are smart groups. The ability to granularly sort through devices in your instance is a massive time saver. It also makes deploying apps and polices a breeze. Aside from that, the amount of features available for finely tuning mobile devices is second to none.\n\nOutside of the Jamf Pro itself, our customer success rep Taylor is phenomenal. She is always availble to answer our questions, has a wealth of knowledge when it comes to Jamf, and in the rare occurence where she doesn't have the answer, she will either put us in touch with who does or gets back to us lightning fast!I wish there was the ability to drag and drop your categories to sort them how you like. Removing and adding everything 1 by 1 is tedious.As a remote company, being able to deploy devices with minimum of user interaction for setup is crucial. Our onboarding process has been streamlined with the help of Jamf and allowed the IT team to minimize our weekly footprint within those meetings.\n\nKeeping track of our 1000+ devices and making sure we're staying in our compliances and staying on top of application and OS updates.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Amazing Product with Steller Support",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-8633697",
        "body": "Jamf Pro provides my organization with the ability to manage its Apple infrastructure with ease while providing our students and faculty  a seamless experience. The ease in which I can deploy apps to a large quantity of Apple devices is a huge time saver in my day. If an instructor needs an app deployed to iPads in a classroom NAOW!, I can do that! If an instructor decides s/he needs a specific app pushed out to classroom iMacs, I can do it all from the convenience of my office and schedule the time/date of the deployment so as to not disrupt the learning process in the classroom.\n\nIf an end user reports a problem, Jamf Pro provides me with robust tools allowing me to suss out the issue in short order and resolve it in a timely manner. This is deeply appreciated by my end users.\n\nJamf provides a plethora of training materials for Mac admins ranging from \"newbie\" to \"highly experienced Mac Gurus\". The Jamf community is phenomenal when one has questions or just looking for like-minded people. The community is a fabulous resource!\n\nLast but not least, the Jamf Support staff is beyond amazing! This group of highly skilled individuals knows the system inside and out and are a pleasure to work with when needed. The few times I have needed support, the response has always been quick and thorough.There are no downsides about Jamf Pro. The product is easy and intuitive to use.In an predominently Windows environment, our Apple hardware (and users) have felt like third class citizens. Jamf Pro gives me the ability to manage our Apple infrastructure with a robust set of tools that rivals (and exceeds) what our Windows users experience.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf, the perfect MDM for Apple",
        "author": "Vic B.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-6610114",
        "body": "My favorite thing about jamf is the ability to easily and simply manage all our apple products. These can be institutionally owned items or personal devices for a BYOD. This can be anything from macs and ipads to AppleTV devices. The choices are phenomenal. We can do simple commands such as locking the device to higher-level items such as pushing script to the self-service portal for end-users to send us logs.I dont like the fact that apple limits jamf to control only. certain items. I completely understand there are certain areas that may be legally pressing but man is it difficult to try to set up a remote user and they need admin credentials to allow the ability to screen share in zoom.We are solving our ability to manage apple devices with jamf pro. We didn't have a solution previous to this and the google admin console didn't provide the solution we truly needed. We realized many benefits, we can apply restrictions to these devices, and we can send out applications or even homemade applications. We can even send out scripts like we do with our windows environment",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "The gold standard of Apple management for a reason",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631216",
        "body": "Jamf Pro collapses space and time by enabling admins to apply configurations and changes dynamically, automatically and consistently, regardless of when or where.Jamf Pro has amassed considerable tech debt over its two decades, and the management console has not seen any meaningful updates in years. Plenty of weird little quirks that you just have to learn. No built-in SIEM and very limited reporting.Jamf Pro lets me install a base configuration of apps and settings across my fleet, keep those updated and enforced, and provide users with a \"self service\" app catalog. Jamf's ability to dynamically adjust policies and settings based on the device state allows for granular flexibility and responsiveness to developing changes or issues. necessary changes can be set once and happen as the devices check in automatically, rather than any manual intervention.\n\nOnce, I had to deploy some new color workgroup printers as part of the merger of separate business units. My users were in Jamf Pro; the others were not. Out of the entire user base, several were traveling during the actual printer install. I simply mapped the new printer queue, created a group of devices that didn't have this new queue, and created a policy to remove the previous queues when adding the new one, and let it run. Within minutes, my users were up and running, and I wasn't even in the same building. Meanwhile, the non-Jamf devices had to be attended to by helpdesk staff, who manually configured each device; one of them did the setup incorrectly, resulting in dozens of tickets and lost productivity.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Succeed with Jamf",
        "author": "Raul G.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-4238910",
        "body": "Jamf has allowed us to maintain hundreds of Apple devices right from our desktops without having to put hands on those devices.There is a steep learning curve to Jamf but once you have it, life is so much easier.Jamf offers a lot of support and has a great community who shares their knowledge with each other. Make sure to use those resources.I am installing and uninstalling apps on our users' devices without taking the devices away from them. Jamf offers a lot of benefits and features to our users, giving them more access and support in real-time.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect is outstanding for our organization.",
        "author": " Patel R.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-9370789",
        "body": "Previously, users in our organization maintained separate passwords to access the system and other applications. However, with the implementation of Jamf Connect, we have successfully streamlined the login process. This improvement has led to increased satisfaction among both users and the service desk teamWhile we're still in the early stages of familiarizing ourselves with the platform and its functionalities, we're eager to explore its full potential. We hope for enhanced compatibility with various identity platforms, as our organization differs from others in its use of identity systems. Overall, we haven't encountered any significant issues thus far and remain optimistic about the future integration of the platform into our processesPreviously, users in our organization maintained separate passwords to access the system and other applications. However, with the implementation of Jamf Connect, we have successfully streamlined the login process.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "One stop MDM",
        "author": "Lee G.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9711756",
        "body": "SInce moving to Jamf Cloud, all functions have improved including package distribution using cloud DP's and the ability to reach all devices off the corporate network. This is now allowing many new cloud based integrations with  Azure, Jamf Connect, etc.The level service desk seems to have some challenges, but they have improved the support work flow.We are trying to take advantage of MDM mass action commands for Apple Software Updates, using DDM especially for Apple Silicon devices and forcing reboots. At this time, it is not actually production and not 100% reliable yet.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect + Jamf Pro easy to use",
        "author": "Jacek Z.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-9165006",
        "body": "after a few issues (no experience) while starting with jamf connect i find, that jamf connect is relativ easy to configure and use. We are using jamf connect since almost 3 years (i think) and i started with it after a few months of our jamf pro journey :)\nits really easy to update (not the built in update mechanism)\nIts really good maintained from jamf\na lot of possibilitys.\nIt was relativ easy to implement in jamf and azure as well.\nconfigure jamf connect in jamf pro gui.\nguides from jamf are very good and helpfullmaybe such a lot of updates in short time\nsome bugs in the jamf connect configuration app (I havent used it now for maybe 1.5 years)Enrollment issues with user creation.\nChanging passwords on mac.\nThe biggest benefit for us is the time saver in many aspects. So time is money and more time for me to do other things as explain the user how they should create the user account on the macbook",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "IT Admin",
        "author": "Santosh P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9695193",
        "body": "I especially like the extension attribute and prestige enrollment. the support from the jamf team is very Good. All the Jamf tools are so user-friendly.There is nothing to dislike about Jamf, whatever things are required we can get from the documents and the Jamf community pages.We have 3000+ Mac Devices and it was difficult to manage in a proper way on Intune we moved to jamf after migrated all things ran so smoothly and jamf pro is user friendly MDM which we like most,",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Mac Management Made Easy",
        "author": "Rob T.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630285",
        "body": "The amount of control and feature sets enabled in Jamf Pro, enable us to bring our Mac setup time down to zero for both end-user setup and IT setup and deploymentThe inability to not be able to unlock a local Mac OS user account from the Filevault unlock screenWe're able to deploy all our security tools to all the Macs in our organization, we're able to monitor and get instant reports when devices are failing to check in or don't meet certain criteria, this is really strengthening our security posture",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Outstanding MDM",
        "author": "John H.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-6597811",
        "body": "Ability to create pre-stage enrollments, saving time when re-imaging iPads every summer. Also, the support you get from Jamf is second to none. Overall, a Great product!Not a whole lot to dislike about this product. It just works.Jamf Pro allows you to remotely manage your devices (both iPads and Macs) with great ease.I can now remotely manage our iPads and install applications as needed and/or requested by teachers.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Pro in a K-12 environment",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631918",
        "body": "Jamf Pro is a reliable MDM that is easy to understand. We've had the best experience with the Jamf Cloud environment. Jamf Pro helps to keep all of our Apple devices up to date with the latest software versions and OS patches. Our Jamf Pro instance is accessible 24/7/365 from any location with an internet connection. In emergencies, I've accessed the admin console from my phone! The Jamf Nation community is by far, the best resource for troubleshooting, exchanging ideas, and collaboration with other Jamf users around the world.Whenever I find gaps in our MDM, I quickly fill out a feature request. I will also upvote other feature requests that would be helpful in improving the Jamf Pro experience. I've used Jamf for 10 years now and I've seen how much the platform has improved.Jamf Pro provides centralized management of endpoint deployment, application management, end user autonomy, and device security. This saves us countless hours of IT labor and creates happy end users.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Been on Jamf since Casper!",
        "author": "Matthew S W.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-8051815",
        "body": "Simplest management for macOS that I have experienced. Allowed me to easily create a near zero-touch deployment model that our Service Center loves.I wouldn't say there are downsides. The few issues I have are really related to our legacy on-prem environment not having script editing on the site.Mass management of our macOS fleet. We have easily been able to configure a consistent security baseline that we can be sure is securing our endpoints.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Jamf continues to be the go to Mac MDM in the market!",
        "author": "Michael Z.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9629966",
        "body": "easy to use interface.  Integration with All Major platforms like intune. Jamf Nation is a great community ready to help each other out with issues as they arise.device count can get high and out of hand leading to high costs if you don't unmanaged/remove unused devices.applying config profiles and managing devices in our org. we can push policies and updates instantly and it saves our team a ton of time.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Apple Vision One",
        "author": "Ankit A.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9243968",
        "body": "So let me tell you about this product, as you all know that this product is very useful for apple products like ipad, iphones, MAC and Apple TV. This product is MDM which helps user to get access to their devices on single management console. It also helps user to get device information, performance and capability including device performance and vulnerability associated with different devices. For user its very easy to use. Also you can integrate several endpoint security data collector along with this Jamf Pro. Inshort it's very easy to implement in any place.Honestly i dont dislike anythink about Jamf Pro as it helps lot of user to get visibility of their devices on single console. Without Jamf Pro it's hard to determine system performance and device information in complex environment which consists several devices.Jamf Pro is solving many organisation's problem including clients/users not able to view their device performance , not able to detect whether their devices are healthy or not. Also you can easily deploy any sort of application or any rules along with policy at a time without doing any sort of misconfiguration. This product benefitting user in many ways like sorting the issue related to device misconfiguration and many more vulnerabilities.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Recommendations about Jamf Pro",
        "author": "Atanu Kumar B.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9242620",
        "body": "Jamf Pro is basically an industry-leading solution that delivers the best and most secure end user experience for Mac, iPad, iPhone and all other apple devices. It can manage all of our Apple devices and secure them to stay protected against security threats and viruses and prevent from external security threads as well.For now there is no negetivity in Jamf Pro as it's working principle based on security. but yeah one thing one the upcoming days msny new viruses and threads are gonna come so in that case Jamf Pro must be powerful and efficient so that it can protect all the Apple devices.Here the whole thing depends on security and thredas and there comes Jamf Pro where it provides all the security to all the Apple devices and help us to use our apple devices very efficiently and with no virus. It also solvibg many use cases where it providing support by it's capability to manage productivity applications such as Office 365 suite apps, VPN, Google Chrome and other business apps in real time.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    },
    {
        "title": "Best MDM for Apple devices that we know",
        "author": "Joris K.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9641753",
        "body": "The simplicety it all comes togehter and how easy to understand the management user interface is. Though your can configure real advanced configuration with Jamf to mange your Apple fleet, it is very easy to get used to the portal. Before you know it you will get the hang of it and are deploying scripts, applications and polcies.The monitoring of policies and applications on what is being applied or not can be sluggish to work withhJamf is helping us manage our Mac OS fleet. We currently only have Macbooks in it. No matter where they are, IT (us), are always in control.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Excellent solution for our organization",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8686430",
        "body": "When I started at my company four years ago, the team was binding Apple computers to the domain.  There were constant issues cropping up, and support tickets on a regular basis in regards to password changes and sync issues.  We were already a Jamf customer and I came across Jamf Connect.  After implementing Jamf Connect in our org, we've been able to enforce password policy with far less headache and less support request from users. The product is easy to use and the password change process is easy enough for users to remember with very little instruction from the IT side. Updating Jamf Connect is as simple as pushing out a new policy from Jamf Pro, which is really nice as well.The UI for password changes has been updated over time by Jamf, but could still perhaps be a little easier for end users to understand,. perhaps more graphics and different verbiage through the process?Using Jamf Connect, we don't have to bind Macs to our domain, which prevents a number of support issues from cropping up.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Admin - Tufts University",
        "author": "Denise L.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8633866",
        "body": "We have just started using Jamf Connect in order to deploy macs with zero touch technology.  It is invaluable to the process and wouldn't be possible in our environment without this product.  The ability to have our users set up their own device by signing in through Jamf Connect and then syncing their passwords for ease of one password is something that our users have come to expect and we are so happy to provide this to users with a dropped shipped Mac that we haven't touched at all.It is still new to us so we are still learning all the ins and outs but would like to see greater compatibility with different identity platforms since we don't use Okta like most others do.  All in all, don't have anything bad to say at this point in time in our processes.Zero Touch deployment for remote and on site staff for macs.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect and Entra AD",
        "author": "Todd H.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-9185848",
        "body": "Helps us authenticate Macbook users to our AD environment. Very nice login window experience.No negatives that I can think of right now. Upgrading versions is much easier now than a few years ago.It helps me authenticate users to our Macbooks.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect streamlines onboarding even further!",
        "author": "David M.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8560036",
        "body": "I've helped many organizations intergrate both their Azure AD and Google Workspace directories into Jamf Pro using Jamf Connect. While initial deployment includes some complexity, the custom experience we can create for users is unmatched. Not to mention the simplicity of allowing a user to basically self-provision a Mac without direct IT involvement. Game changer.No downsides to the product we've seen so far. We do recommend taking advantage of Jamf's on-boarding support as every customer we've taken onto the platform has encurred some form of customization. And the integration requires advanced understanding of Jamf Pro, Jamf Connect as well as the directory provider interface. But it's well worth the energy once you watch a user un-box a factory Mac and quickly get to a fully configured desktop complete with a user account, mail, apps, documents, and preferences -- all with zero IT touch.Without full directory integration and user account snycronization, we were assigning IT staff to perform user account creation for each end user. While we could push apps and services with Jamf Pro, Jamf Connect added the final step. Now a user simply logs into a properly enrolled company-owned Mac with their email credentials ... and magically a full, local user account is created. And if a password is changed on the Mac or at the directory server, the password is sync'd between platforms. We reclaim IT services for both deployment and forgot password support. Win-Win.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "JAMF Connect, Worth it!",
        "author": "Javier O.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8613618",
        "body": "The seemless integration and syncing of passwords introdued in JAMF Connect allows our users a friendly way to get their new password setup and shared across other aspects of our company.There are times where you can't type the credentials in JAMF connect because it's still trying to license the application. This does take a bit of time during setup at times which can cause some frustrations to our Techs who are imaging the computers and trying to get them out quickyThe biggest hurdle we were running into was having users be binded to our AD. With JAMF Connect, it changes those network accounts into local admin accounts which allows the user more flexibility when it comes to installing applications on their device. Resetting passwords has never been easier with a simple click on the top right menu bar.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    },
    {
        "title": "I heart Jamf Connect",
        "author": "Samantha H.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8764360",
        "body": "Ease of Use. That you set it up and it works!That unless you specfically set it up to do otherwise, you must be online to log in.We were using just local accounts, and then we started using Nomad (with AD credentials) but Nomad never quite worked right. There were always bugs and issues. With Jamf Connect- we were able to not use local accounts, but to use azure credentials and only have one password which was so much better than Nomad and no one ever remembering to update it when they changed their AD password. Jamf Connect just made my day as an admin so mcuh better and easier. It just worked.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Create accounts with AD Password sync",
        "author": "Mark C.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8566501",
        "body": "What I love most about Jamf Connect is my users can utilize the speed and dependability of a local account on mac but have it secured with our cloud IDP. This prevents unauthorized users from creating an account on our devices if lost.I dont have a ton I dislike about jamf connect. If I had to nitpick it would be in the configuration of the app and applying a license code to activate which can sometimes show expired on an end user computer when it isn't. Since Jamf Pro and Jamf Connect are connected I feel that the account itself should authorize the app.Jamf connect helps standardize my user account names, helps with password changes, password synchronization, kicking off Filevault 2 as well as linking user drives if applicable to the user.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect - a true jack of all trades",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8576699",
        "body": "We use Jamf Connect in the organization to provide our corporate IdP to macOS users. It is especially important to us that there is a deep macOS integration to create a seamless user experience in conjunction with Jamf pro.\nTrue to the Apple standard that everything works as fast and easy as possible.Sometimes, unfortunately, it happens that an update brings a bug that makes internal adjustments necessary. But with the help of Jamf Support all problems could be solved until now.We have a user choice option which allows users to use macOS devices or Windows devices. To ensure seamless operation of the IdP, we rely on Jamf Connect.\nThis allows us to achieve a high level of user satisfaction.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect Helps Our University with Account Creation and Access",
        "author": "Josh H.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8576697",
        "body": "Jamf Connect is one of the few tools that provides on demand account creation on macOS with an Identity Provider. We have also used it in congunction with enabling FileVault and it helps our users get FileVault enabled on first login.Jamf Connect allows us to set access to devices based on authentication with our Identity Provider (Microsoft Azure AD) but the downside is it doesn't offer much in the way of preventing or revoking access to locally created accounts once they are disabled or deleted from our Identity Provider.Account creation and access on all of our Apple macOS client endpoints. It also helps with password syncing locally on the Mac when a user changes their IdP password.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Simplify Mac Deployment",
        "author": "Jeff A.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8023151",
        "body": "Jamf Connect has allowed us to give our end-users brand-new Macs without my team having to touch the device ahead of time. This saves my team and our end users a lot of time. The setup of a new Mac for the end user is simple and we get very few help desk calls related to a new Mac deployment.Getting set up with Jamf Connect is not for the faint of heart. Thankfully, Jamf includes professional services to get the environment set up and there is a great support community at Jamf Nation and on the #jamfconnect channel at the MacAdmins Slack site.SInce we are 100% remote as a company, there was a challenge of getting new computers to end users. Jamf Connect handles the macOS user account creation and leverages Jamf Policies to push required software to new Mac automatically.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Great product with malleability!",
        "author": "Jarred W.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8597619",
        "body": "Jamf Connect is a great way to use cloud IdPs for authenticating to macOS and keeping cloud passwords in sync with the locally created account authored by Jamf Connect.  Filevault key synchronization and having all of these passwords stored in the keychain makes it a breeze.I don't like how they only really support OIDC AND ROPG calls instead of straight OIDC.  This limits some cloud providers like Shibboleth from working natively with the application.Managing and maintaining users on macOS is a breeze.  It's  also very comforting knowing that our cloud IdP is the source of truth for password forced changes and synchronizations.  We no longer have a \"wild west\" macOS environment.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Simplified our authentication to a single source - our Gmail!",
        "author": "Tom C.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8577772",
        "body": "That I do not have to create multiple users or multiple systems to authenticate a user. We create a user in GMail and that is all we have to do. GREAT feature!I do not have anything to dislike. There are areas that are getting better and maturing, but nothing to dislike.Prior to JAMF Connect, we had Apple OD. We would have to import over 400 users a year. We also had to add the users to GMail. Now we only need to add users to GMail and do not need Apple OD anymore. So, Jamf connect reduced the work to add users to our systems and reduced hardware we needed. Double bonus!",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf connect. The best way to log into a Mac.",
        "author": "Tim G.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8200688",
        "body": "The setup was easy with the configuration session with a Jamf employee. The app itself allows a much better user experience compared standard AD Binding which we have used in the past.Nothing really. It has replaced our mobile account provisioning process and has been able to be a reliable and solid solution for user authentication.\nIf anything, not having it part of the Jamf app catalog, to self manage updates, is a little annoying, but not a deal breaker.The problem it solves is user authentication and account creation on our fleet of macOS across the school. Jamf connect makes this easy. It's also great in our classroom labs, allow multiple users to sign into different macs when needed.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Perfect SSO and Permissions Tool",
        "author": "Erik A.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8266617",
        "body": "I love how easy it is to integrate with our Azure AD IDP.  Jamf always tries to implement their customers' ideas to improve the product.  It looks professional as well.  The overall look doesn't have a thrown-together look.The update process can be complicated when Jamf releases a new version.  Sometimes some settings that were part of past versions need to be changed or added.  You have to pay attention to the release notes.Jamf is good at listening to their customer's needs, and they're constantly implementing new features.  It helps us keep our users safe and getting them the permissions they need while using our Mac fleet.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect makes our Mac Deployment really user-friendly.",
        "author": "Niklas K.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8225925",
        "body": "Jamf Connect helps us immensely in the company, whether it's the initial set-up of MacBooks by employees or changing passwords. The range of functions cannot be listed completely in this review.So far, we have hardly noticed any weaknesses. We once had a bug with an SSO extension, but it was immediately fixed with the next update. Thanks again to the support.We use Jamf Connect in the initial setup to create the local account. During operation, we then synchronise the password via Jamf Connect.\nJamf Connect has made it possible for us admins to no longer have to hold a MacBook in front of the user.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Support…. Made simple for your end user",
        "author": "Lance W.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-7836401",
        "body": "We are using Jamf Connect in 2 ways.\nThe first is Jamf Connect login and the other is the Jamf Connect Menu Bar.\n\nThe Jamf Connect login gives us 3 Factor Authentication (local password to unlock FileVault, Azure credentials and Authenticator approval). This is only needed on restart or after shutdown.\nJamf Connect & the menu bar allow for Microsoft SSPR (self service password reset) or writing directly to a URL where users reset their password (to on prem AD).\nWe use Microsoft SSPR, and Jamf Connect syncs the password with the local login password.... cutting down the number of passwords users need to remember.\n\nI have also configured a few actions in the menu bar, where with 2 clicks, it will open Mail, compose an email with our webhelp address already filled in.\nIt is heavily customizable.... I absolutely love it.Jamf Unlock is being deprecated 😭 😭 😭Staff are always complaining about too many passwords. This keeps their AD and local logins the same",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "JAMF connect has changed our whole mac deployment workflow! in a good way",
        "author": "Javan R.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8600678",
        "body": "what I like most is not having to bind our macs to the active directory domain anymore. I also like that it automatically changed the network account to a local account ^_^The set up was realllly confusing with version 1.0. Jamf connect 2.0 is an easier set up, but it could still use some simplification for the not so advanced JAMF pro user.it solves the problem of switching from an Active directory-based network log-in for our MacBooks, to an Okta based log in that is way more seamless and useful.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "JAMF Connect Review: Seamless Integration at Its Best",
        "author": "Robert G.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8577113",
        "body": "What truly sets JAMF Connect apart is its streamlined approach to user authentication. The one-time sign-on feature greatly enhances user experience, allowing users to access all necessary resources without the hassle of multiple logins.I really have no complaints on the product, maybe just that there are a LOT of updates for the program but that also may be a good thing?The ease of deployment is another noteworthy aspect. Integrating JAMF Connect with platforms like Azure AD or Okta is straightforward, eliminating the often complex setup processes found in other solutions.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Can't imagine a better user experience for Mac enrollment",
        "author": "Tobias L.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8576981",
        "body": "I really like to give the user this seamless experience where he can just log into the mac with his Microsoft365 or Google Workspace credentials and then have the password in sync with his cloud account. It's also a great way to protect the mac login with MFA.The configuration could be more intuitive.- Easy user based mac deployment\n- enforce Multi-Factor-Authentication for user account\n- Keep user password in sync\n- make sure that only users that have an active account with our IDP can log into a company mac",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Great for Mac SSO",
        "author": "Andrew N.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-7873491",
        "body": "Jamf Connect is easy to use, setup, and has lots of documentation to help you. There are lots of people that are using it that can help you out, my staff have had no complaints to date in using it this year at all.One issue I would say Jamf Connect has for me is the documentation at the time I was setting up Jamf Connect did give many examples to go by so I  really had to do a lot of testing to make sure I was configuring it the way my end users would enjoy.We needed SSO with a either Google or Microsoft for Macs and Jamf Connect solved that for us, especially since we are already in the Jamf ecosystem it just made sense.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4.5,
        "platform": "G2 "
    },
    {
        "title": "Best JAMF connect tool so far",
        "author": "Yogesh P.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8410273",
        "body": "Account creation and authentication: create secure accounts that get users up and running immediately with a single set of cloud identity credentials.\n\nEase to configure and useHaving to log on 3 times can be a bit annoying (FileVault, Azure, Local login.\n\ninitially require lots of configuration.Authentication and Identity access, filevaulte",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 5,
        "platform": "G2 "
    },
    {
        "title": "Jamf Connect for 1 to 1 device login management",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8576965",
        "body": "Jamf Connect has helped us not have to bind devices to Active Directory and get everyone logged in with ease.Jamf Connect took us about 3 years of testing and a lot of meetings with specialists to get us to this point.  Azure AD solutions have taken a while to get to the point where they are working smoothly.  There seems to be one person at Jamf who truely knows how to set everything up (Sean Rabbitt), and that limits quick support to find solutions.  More techs need to be brought up to Sean's level.Demobilize accounts and allow users to log into devices for the first time while not on campus.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    },
    {
        "title": "JAMF Connect is almost there for EDU",
        "author": "Curtis B.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8634288",
        "body": "We love the idea of enforcing 2FA using Connect and Google. It is a great product for a quick and easy login solution.JAMF connect does not assign an MDM capable user, which makes it not ideal for EDU as Apple classroom uses the MDM capable user for Edu profile distributionEasy solution for multiple user devices while maintaining secure sign in",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "1",
        "rating": 4,
        "platform": "G2 "
    }
]
