[
    {
        "author": "Many_Plan_936",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/lljqjeh/",
        "body": "JAMF is the Cadillac option, and it’s what Apple pushes in house. That said, you really pay for the privilege. \n\nThe real question is what features do you need. If it’s a vanilla setup with common apps, and users are empowered to do things like add their own printers with AirPrint; InTune is just fine.  You can add extras like XCreds or JAMF Connect to enable IdP login + LAPs and you’re good to go. \n\nIf you need to heavily curate the user experience, that’s where JAMF is worth the money. Zero touch OS upgrades, printer driver install and setup on demand, unique app deployment scenarios; all of that is easier with JAMF. Easier in the end, but it trashes a lot of time dialing it in. \n\nI have a large institution where we manage a fleet of nearly a thousand of Macs & iPads with JAMF. I have a smaller client that’s 50/50 Mac and PC; we do that all within InTune. \n\nIf you’re already an M365 shop, try InTune first IMO. JAMF will always be there to take your money if you want to make the jump. 🤪",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "relevance_score": "10",
        "created": "2024-09-04 23:38:48",
        "upvotes": 1,
        "relevance_scores": 10,
        "id": 0,
        "summary": "JAMF offers advanced management features for Apple devices, ideal for curated user experiences, but is costly. InTune is suitable for simpler setups."
    },
    {
        "author": "drkstar1982",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwjapvx/",
        "body": "Just fyi on the patching part. JAMF Pro cloud does have the ability to do patching via DDM. I have about 1260 users worldwide and our first big test of DDM got us to 99% compliance within 24 hours of our schedule update deadline. Which is a miracle.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "created": "2024-03-25 19:55:07",
        "upvotes": 4,
        "relevance_scores": 9,
        "id": 1,
        "summary": "JAMF Pro cloud's DDM patching achieved 99% compliance within 24 hours for 1260 worldwide users, demonstrating its effectiveness and efficiency."
    },
    {
        "title": "Recommendations needed - Moving from Jamf to a new MDM, Jamf Connect like features are critical.",
        "author": "sudo_brandon",
        "url": "https://www.reddit.com/r/macsysadmin/comments/1eyk11f/recommendations_needed_moving_from_jamf_to_a_new/",
        "body": "I have been a Jamf Pro admin for since Casper, 400 certification, managing 1000+ endpoints globally (100% mac)... We have to leave Jamf due to costs.  We are looking at Kandji, Jumpcloud, and Mosyle.  Okta is are idP but we are entertaining moving to Jumpcloud as well.  In Jamf we heavily rely on Extension Attributes, Smart Groups, and Jamf Connect.  What are your recommendations?  What are you using with likes/dislikes?   \n\nMy likes/dislikes with Jamf Pro is a great product but it's expensive.  It's reliable until the binary breaks and produces 'Lost Sheep' that dont check-in.  The interface is very solid but there is a steep learning curve.  I fought hard to keep it and demonstrated the massive difference between Jamf and Kandji but I lost the C-level money war.\n\nYour advice will help tremendously. ",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "9",
        "subreddit": "macsysadmin",
        "created": "2024-08-22 13:58:53",
        "upvotes": 22,
        "relevance_scores": 9,
        "id": 2,
        "summary": "The user, a Jamf Pro admin, is seeking alternatives due to cost, considering Kandji, Jumpcloud, and Mosyle, while evaluating Jumpcloud for identity management."
    },
    {
        "author": "MDMMAM_Man",
        "url": "https://reddit.com/r/Intune/comments/1f6ynd5/intune_vs_jamf/ll3tbnw/",
        "body": "Intune is great for iOS and iPadOS but Jamf is still the leader for MacOS. 300 Macs is a decent fleet and the extra’s in Jamf will make your admin life easier and users will get a better experience.  I believe Intune will get there but back to back there are still some differences. Support from Jamf is really good and I always get good feedback back from their engineers.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "created": "2024-09-02 05:42:45",
        "upvotes": 21,
        "relevance_scores": 9,
        "id": 3,
        "summary": "Jamf remains the leading choice for managing MacOS, offering superior features and support, enhancing admin efficiency and user experience compared to Intune."
    },
    {
        "title": "Jamf Pro provides excellent customer support and has helped us improve our overall productivity.",
        "author": "Trevor L.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9629708",
        "body": "The platforms are feature rich, easy to use and are well designed while not overly cluttered with too many widgets. The main Jamf Pro dashboard is easy to customize and tailor to our specific needs.  Reports are packed with powerful and yet simplified data in a visual structure that is easy to read and understand for even the lay person.I have found that when looking for information it can be a bit of a fact finding mission, even though the documentation is really well written, it can be hard to locate it. The web generated reports are as beautifully crafted as they are, it is hard to utilize for offline reporting needed for presenting to board members. Since a lot of these wonderful reports are in web only format, possible relevant data for export seem to be very limited in scope. This also leaves us relying on third party tools and utilizing more user and financial resources to generate similar yet far less accurate reports.Since most of the organization is remote, remote administration is a critical feature to support managing of our devices remotely. It allows us to securely access and configure devices from a centralized location, reducing the need for on-site visits or manual intervention.\nEndpoint security is an important issue and Jamf Pro ensures that all devices are protected against malware and other cyber threats, preventing unauthorized access and data breaches.\nIdentity management integration with Okta and Google provides users with an authenticated login to access our varying corporate infrastructure and prevents unauthorized users from accessing sensitive information.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 4,
        "summary": "Jamf Pro offers customizable dashboards, simplified reports, and remote administration, enhancing endpoint security and identity management integration, though offline reporting capabilities are limited."
    },
    {
        "title": "IT Admin",
        "author": "Santosh P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9695193",
        "body": "I especially like the extension attribute and prestige enrollment. the support from the jamf team is very Good. All the Jamf tools are so user-friendly.There is nothing to dislike about Jamf, whatever things are required we can get from the documents and the Jamf community pages.We have 3000+ Mac Devices and it was difficult to manage in a proper way on Intune we moved to jamf after migrated all things ran so smoothly and jamf pro is user friendly MDM which we like most,",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 5,
        "summary": "Jamf provides excellent support and user-friendly tools, making it ideal for managing over 3000 Mac devices smoothly after transitioning from Intune."
    },
    {
        "title": "Amazing experience, and easy to use",
        "author": "Jeremy H.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631022",
        "body": "Jamf Pro has made it extremely easy for a user like me, who does not have prior experience with Apple device management, to manage multiple Apple devices, from computers to iPads to Apple TVs. We started using Jamf Pro just to manage our Apple Computers, but have since added over 100 other devices which are super easy to manage as well. Using profile enrollments makes settign up new devices extremely simple. On top of all of this, Jamf Support is wonderful to work with, and always respond super quick.There is not much to dislike. My only wish is that you could add an Apple account to a device through Jamf Pro. This would make it easier for iPads and Apple TV's where we use the same Apple ID on them, and lock the devices in Single App Mode. Not having to manually log in on each of these devices would make the experience that much better.Jamf is making the management and deployment of our Apple fleet so much easier than it had been. It is also very reasonably priced, which helps in an economy where budgets are tight.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 6,
        "summary": "Jamf Pro simplifies Apple device management for users without prior experience, offers excellent support, and is cost-effective, though lacks Apple account integration for devices."
    },
    {
        "title": "Easy to use and easy to maintain",
        "author": "Simon A.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630769",
        "body": "I like how easy it is to get going and make changes. You can be as advanced as you want or as simple as you want and things work either way. It has really helped us solve a lot of issues quickly that were happening when our devices were not managed properly.Most of the downsides we have are not even related to JAMF itself but more than likely our own enviroment and users. With that being said we do have an issue of devices losing contact with JAMF services and never being able to recover even though the show in the JAMF portal but a simple wipe which takes total time from wipe to user working is 30min for us so its not a huge issue.It allows us to deploy things to our remote users and in office users with ease and empower users to be self suffecient in a lot of areas as we just add things to self service or send a something via JAMF and it gets done in the background its great.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 7,
        "summary": "Jamf simplifies device management, enabling quick issue resolution and empowering user self-sufficiency, despite occasional connectivity issues easily resolved with a device wipe."
    },
    {
        "title": "Jamf Pro great for One to One Apple Environments",
        "author": "Dylan A.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9499443",
        "body": "Jamf Pro's admin user interface is simplistic in use, but verbose in its capability. I am in it every day to monitor our Apple fleet. I enjoy Jamfs Training courses. I have been able to customize it to our organizations unique needs.We have had some issues in the past with Jamf's customer service. They boast same day support for Apple features/products, but I have not always found that to be the case.Our organization has almost 12 thousand Apple mobile devices and 2,200 Apple Computers to manage. Jamf Pro places that management all in one place for ease of setup and continued monitoring. We use some of Jamf's other products like Protect and Connect to easily manage all of these devices with seamless integration across Jamf products.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 8,
        "summary": "Jamf Pro offers a user-friendly interface and robust capabilities for managing Apple devices, with customizable features and seamless integration, despite occasional customer service issues."
    },
    {
        "title": "Easy and robust!",
        "author": "Jason P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-8060778",
        "body": "Jamf Pro makes managing our device fleet relatively easy. The interface is quick to navigate and intuitive making it a snap. Key fetures, such as Locate Device, remote wipe, inventory, IP address, last known loaction and a host of others make the infomation very useful.I fell that that navigating back to a search is a bit challenging. For example, if I search for a device by name, I can't just click the back button to go back to my search. I have to click the category and retype the number. Minor inconvenience.Jamf is allowing me to manage my entire Apple fleet from one place. This makes centralized management easy and convenient and allow us to be more productive and rollout changes, updates, and new programs quickly.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 9,
        "summary": "Jamf Pro streamlines device management with an intuitive interface, offering features like Locate Device and remote wipe, enabling efficient centralized management of Apple devices."
    },
    {
        "title": "Jamf, the perfect MDM for Apple",
        "author": "Vic B.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-6610114",
        "body": "My favorite thing about jamf is the ability to easily and simply manage all our apple products. These can be institutionally owned items or personal devices for a BYOD. This can be anything from macs and ipads to AppleTV devices. The choices are phenomenal. We can do simple commands such as locking the device to higher-level items such as pushing script to the self-service portal for end-users to send us logs.I dont like the fact that apple limits jamf to control only. certain items. I completely understand there are certain areas that may be legally pressing but man is it difficult to try to set up a remote user and they need admin credentials to allow the ability to screen share in zoom.We are solving our ability to manage apple devices with jamf pro. We didn't have a solution previous to this and the google admin console didn't provide the solution we truly needed. We realized many benefits, we can apply restrictions to these devices, and we can send out applications or even homemade applications. We can even send out scripts like we do with our windows environment",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 10,
        "summary": "Jamf simplifies managing Apple products, allowing control over institutional and personal devices. It enhances device management, despite some limitations imposed by Apple."
    },
    {
        "title": "The gold standard of Apple management for a reason",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631216",
        "body": "Jamf Pro collapses space and time by enabling admins to apply configurations and changes dynamically, automatically and consistently, regardless of when or where.Jamf Pro has amassed considerable tech debt over its two decades, and the management console has not seen any meaningful updates in years. Plenty of weird little quirks that you just have to learn. No built-in SIEM and very limited reporting.Jamf Pro lets me install a base configuration of apps and settings across my fleet, keep those updated and enforced, and provide users with a \"self service\" app catalog. Jamf's ability to dynamically adjust policies and settings based on the device state allows for granular flexibility and responsiveness to developing changes or issues. necessary changes can be set once and happen as the devices check in automatically, rather than any manual intervention.\n\nOnce, I had to deploy some new color workgroup printers as part of the merger of separate business units. My users were in Jamf Pro; the others were not. Out of the entire user base, several were traveling during the actual printer install. I simply mapped the new printer queue, created a group of devices that didn't have this new queue, and created a policy to remove the previous queues when adding the new one, and let it run. Within minutes, my users were up and running, and I wasn't even in the same building. Meanwhile, the non-Jamf devices had to be attended to by helpdesk staff, who manually configured each device; one of them did the setup incorrectly, resulting in dozens of tickets and lost productivity.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 11,
        "summary": "Jamf Pro enables dynamic, automated configuration management, enhancing flexibility and efficiency, despite tech debt and outdated console, by allowing remote, policy-driven device updates."
    },
    {
        "title": "Succeed with Jamf",
        "author": "Raul G.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-4238910",
        "body": "Jamf has allowed us to maintain hundreds of Apple devices right from our desktops without having to put hands on those devices.There is a steep learning curve to Jamf but once you have it, life is so much easier.Jamf offers a lot of support and has a great community who shares their knowledge with each other. Make sure to use those resources.I am installing and uninstalling apps on our users' devices without taking the devices away from them. Jamf offers a lot of benefits and features to our users, giving them more access and support in real-time.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 12,
        "summary": "Jamf enables remote management of Apple devices, simplifying tasks like app installation. Despite a steep learning curve, it offers strong support and community resources."
    },
    {
        "title": "Mac Management Made Easy",
        "author": "Rob T.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630285",
        "body": "The amount of control and feature sets enabled in Jamf Pro, enable us to bring our Mac setup time down to zero for both end-user setup and IT setup and deploymentThe inability to not be able to unlock a local Mac OS user account from the Filevault unlock screenWe're able to deploy all our security tools to all the Macs in our organization, we're able to monitor and get instant reports when devices are failing to check in or don't meet certain criteria, this is really strengthening our security posture",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 13,
        "summary": "Jamf Pro streamlines Mac setup to zero time, enhances security by deploying tools, and provides instant monitoring and reporting for organizational devices."
    },
    {
        "title": "Jamf: A Disappointment in Every Way",
        "author": "MikaelDez",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "Being the head of IT of my organization, I rarely write reviews, but I felt compelled to share my experience with Jamf, and frankly, it’s been a nightmare. This platform is a glorified mess!\n\nFirst off, the remote assistance tools are a joke. Sessions constantly drop, and the lag is so bad that you’d think we were using dial-up internet. It's infuriating trying to help users when the damn tool doesn’t work half the time.\nAnd don’t even get me started on the update management. I can’t tell you how many times critical updates failed to install. Seriously, how hard is it to get this right? It feels like they don’t care about security. We’re playing a game of whack-a-mole, trying to fix issues that shouldn’t exist in the first place.\n\nThe customer support is equally abysmal. When we reached out for help, it took forever to get a response, and when we finally did, the reps were less than helpful. Honestly, I felt like I was wasting my time.\n\nIf you’re considering Jamf, do yourself a favor and run in the opposite direction. It’s not worth the headaches and frustration. Save your sanity and look for a solution that actually works!",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "9",
        "created": "2024-07-14 11:52:25",
        "upvotes": 1,
        "platform": "Quora",
        "relevance_scores": 9,
        "id": 14,
        "summary": "The review criticizes Jamf for unreliable remote assistance tools, failed update management, and poor customer support, advising against its use due to frustration and inefficiency."
    },
    {
        "title": "Jamf: Great Features, but Lacking in Customer Support",
        "author": "MikaelDez",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "I’ve been using Jamf for our IT management needs for a while now, and while it has some great features, I've encountered several challenges that make me question its overall value.\n\nFirst off, the customer support has been hit or miss. When we initially set up the system, it took a long time to get a response to our queries. I expected more prompt assistance, especially given the complexity of the platform. When we finally got through, the support team didn’t always have the answers we needed, leading to frustrating back-and-forth communications.\n\nThe patch management system is another area that could use improvement. Although it offers automation, we frequently experience issues where updates fail to install as planned. This leads to extra manual work and concerns about keeping our devices secure.\n\nAdditionally, the remote support functionality can be unreliable. Connection drops and lag during sessions make it difficult for our team to assist users effectively. When you rely on tech support, these delays can lead to significant downtime.\n\nLastly, the user interface feels a bit outdated and cluttered. It can be challenging to navigate, even for experienced team members. The documentation could also use a refresh; it often lacks the clarity needed during critical moments.\n\nOverall, while Jamf has promising features, the lack of reliable customer support and some functional shortcomings make it tough for us to fully endorse it. We're considering other options that might better meet our needs.",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "9",
        "created": "2024-02-24 11:52:25",
        "upvotes": 5,
        "platform": "Quora",
        "relevance_scores": 9,
        "id": 15,
        "summary": "Jamf offers promising IT management features, but inconsistent customer support, unreliable patch management, and outdated interface hinder its overall effectiveness and value."
    },
    {
        "author": "ObjectiveAthlete2437",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwimm5u/",
        "body": "You can't really scale with Kandji as witnessed with most organisations with a large install base. From the automated remediation perspective, nothing beats Jamf Pro and Jamf Protect, which is fully integrated for sub minute response. Aside from that, Kandji has limited runway in terms of financing and funding from investors. They are literally on a cash burn without any solid plans for the future. I wouldn't bet my career on a company that might go bust anytime soon.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-03-25 17:42:24",
        "upvotes": 7,
        "relevance_scores": 8,
        "id": 16,
        "summary": "Jamf Pro and Jamf Protect offer superior scalability and automated remediation compared to Kandji, which faces financial instability and limited growth prospects."
    },
    {
        "author": "sudo_brandon",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2zwxh0/",
        "body": "We \"evaluting\" Kandji as a \"cost saving\"... and by we it's the royal we.  I'm a long time Jamf Pro admin (since Casper).  Yes there is a learning curve but the community resources here and on Slack are a huge benefit.  With Jamf Pro you get the fine controls that Kandji does not offer.  Advanced Searches with email schedules, Smart Groups (worth every dime) and Extension Attributes allow for workflows and automation, and huge list of API commands.  I would not be able to do my job as efficiently on Kandji.  I am constantly pulled into Security meetings to help identify and remediate vulnerabilities in our computers.  Using Extension Attributues to identify subjects, Smart Groups as the target of custom policies that deliver a remediation script or package, all automated and reported is just not do able in Kandji.  Jamf Pro crushes it every time.\n\nIf you are a small organization of less than 100 then okay I can see the use case for Kandji but you get what you pay for.  \n\nWatch this video from Rocketman covering their review of Kandji vs. Jamf Pro.  [https://youtu.be/XQJelQ7Qttg?si=mTYyAM\\_3SZs4CKP4](https://youtu.be/XQJelQ7Qttg?si=mTYyAM_3SZs4CKP4)",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-05-07 16:05:34",
        "upvotes": 2,
        "relevance_scores": 8,
        "id": 17,
        "summary": "Jamf Pro offers superior control, automation, and security features compared to Kandji, making it essential for larger organizations despite Kandji's cost-saving appeal."
    },
    {
        "author": "Transmutagen",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2dh61r/",
        "body": "I do a full reimage of 300+ macOS computers once a year by myself with Jamf. I also manage them the rest of the year. I’ve looked into Kandji and it would take a lot more effort for me to do the same work with the same degree of granularity and customization.\n\nI guess if you’re a novice and just getting started managing Macs Kandji would make sense, but for me there’s just no substitute for Jamf.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-05-03 09:33:35",
        "upvotes": 3,
        "relevance_scores": 8,
        "id": 18,
        "summary": "Jamf efficiently supports the annual reimaging and year-round management of over 300 macOS computers, offering unmatched granularity and customization compared to Kandji."
    },
    {
        "author": "cjducasse",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l28i2v8/",
        "body": "We explored this not too long ago, it came down to the effort of moving 400 Mac’s and 5000 mobile devices all needed to be wiped and re-configuring them was a rather large undertaking and not worth… saving exactly $0 because they were reluctant to match our pricing from JAMF. Mind you these devices are spread out across the lower 48 states.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-05-02 12:33:51",
        "upvotes": 0,
        "relevance_scores": 8,
        "id": 19,
        "summary": "The project involved wiping and reconfiguring 400 Macs and 5000 mobile devices across the U.S., but JAMF's pricing made the effort financially unviable."
    },
    {
        "author": "Transmutagen",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2ecfic/",
        "body": "I've been working with Jamf for almost 20 years now, so I'm used to the workflow and how the pieces fit together to get what I want done. The basic building blocks of extension attributes, smart groups, policies, packages, scripts, and configuration profiles are like another programming language for me. The API is also critical to how I manage my devices/computers.\n\nLooking at Kandji I see a lot of the same functionality, but there's a lot more focus on the additional tools that sit on top of that base layer of building blocks. The built-in App deployments, OS Updates, Reporting, and Compliance Mapping look to be really awesome, with the caveat that if how Kandji does it isn't 100% how you want it done you will have to jump through some serious hoops to get what you want. Kandji is more of a \"it just works\" solution - and I'm well past that. I prefer a \"I can make it work EXACTLY the way I want it to\" solution, and for me, that's Jamf Pro.\n\nI'm not knocking Kandji - it's a GREAT solution, and more affordable than Jamf Pro by far. I was just jumping in here in response to the claim that:\n\n>I did the deployment alone for a 400 user company and I feel that would never happen with Jamf.\n\nDifferent tools for different use cases. That's all.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-05-03 13:54:40",
        "relevance_scores": 8,
        "upvotes": 2,
        "id": 20,
        "summary": "Jamf offers customizable device management through extension attributes, smart groups, and APIs, preferred for tailored solutions, contrasting with Kandji's more straightforward, built-in approach."
    },
    {
        "author": "Rocketman-Tech",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la7s89z/",
        "body": "Here's my main advice: \n\nMac Computers: Intune is okay IF you don't currently have management and you want to do something that is \"good enough\" - but Intune doesn't compete with other MDMs (like Jamf Pro) built specifically for the Apple platform. Mac really feels like a side note for them. I will also note that Jamf Pro has some amazing integrations with Intune, so using BOTH platforms is actually the best.\n\niOS devices: InTune is a bit better for iOS. However, one of the major drawbacks is that it takes 8 - 24 HOURS to send any MDM command, where as Jamf Pro (and most other MDMs) will take less than 1 MINUTE.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-06-25 15:09:24",
        "upvotes": 12,
        "relevance_scores": 8,
        "id": 21,
        "summary": "Jamf Pro excels in managing Apple devices, offering rapid command execution and strong Intune integrations, outperforming Intune's slower response times and limited Apple focus."
    },
    {
        "author": "TheAnniCake",
        "url": "https://reddit.com/r/sysadmin/comments/1do6qmw/ama_with_christopher_schasse_and_rocketman_tech/la7zax7/",
        "body": "What bothers me most with Intune is the „speed“. Almost every other MDM managed to instantly check the device in and apply new configs within seconds. Intune can take hours.\n\nOverall, the config templates don’t really cover much but if you can script whatever you need to do, it’s doable.\n\nJamf also has their extension attributes which are a huge advantage in my eyes. Sadly some customers don’t see this the same way. Group creation alone is so much more dynamic with this. Intune‘s groups are.. bad in comparison. Hardly any really usable attributes and as of now I haven’t found any way of using something like EA.\n\nFor a „free“ product it’s certainly not bad. For mobile devices it’s become fairly good, but I‘d never recommend using it for macs.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-06-25 15:49:06",
        "upvotes": 1,
        "relevance_scores": 8,
        "id": 22,
        "summary": "Jamf excels with dynamic group creation and extension attributes, offering faster device management compared to Intune, which is slower and less flexible for Macs."
    },
    {
        "author": "raviyadav432",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktrqfqd/",
        "body": "Migrated from JAMF to Intune 2 years back and since then struggling.\n\nDevice Inventory doesn't have location information.\n\nYou can't modify checkin time which is 8 hours cycle. Forced checkin do nothing except inventory collection. Scripts only run when 8 hour checkin cycle is completed.\n\nScripts execution is unreliable on Intune.\n\nCustom packages were not supported earlier but now Intune has a macOS Package policy as only required deployment. Still have detection rule issues. MS Support has no clue whats the problem. Support ticket is open for last 2 months.\n\nCompany Portal self help has unreliable interface. Once you click \"Install\" any software, it takes very long to appear if something is installing or not.\n\nCustom scripts can't be deployed to Company Portal so that users can directly run on their Macs.\n\nNo Printers support\n\nNo option to flush Scripts/Apps logs except remove the policy completely.\n\nNo Smart Group kind of option. In JAMF, whole deployment was automated with the help of Smart Group.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-03-07 14:30:30",
        "upvotes": 23,
        "relevance_scores": 8,
        "id": 23,
        "summary": "Migrating from JAMF to Intune has resulted in challenges like unreliable script execution, limited customization, and lack of automation features like Smart Groups."
    },
    {
        "author": "RefrigeratorFancy730",
        "url": "https://reddit.com/r/Intune/comments/1b8scad/migrate_from_jamf_to_intunethoughts/ktrn1rc/",
        "body": "I haven't used Jamf in abt 2 years now and used it strictly for MacOS and iOS. hat I remember SmartGroups were really cool, and are more flexible than AAD dynamic groups. Being able to create smart groups based on devices that have 'XYZ' installed is way ahead of anything Intune has standalone at the moment.\n\nJamf has the ability to create groupings in the software GUI so you can expand and collapse categories. The reporting was easier and more intuitive.",
        "subreddit": "Intune",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-03-07 14:08:34",
        "upvotes": 2,
        "relevance_scores": 8,
        "id": 24,
        "summary": "Jamf offers advanced features like SmartGroups for MacOS and iOS, providing more flexibility and intuitive reporting compared to Intune's current capabilities."
    },
    {
        "author": "ResponseThick751",
        "url": "https://reddit.com/r/jamf/comments/1eb47h0/jamf_enterprise_administrators/lf2cq5x/",
        "body": "Just me. 2.2k mixed between iPads, Macs, and AppleTV's. Not to mention the other 5k+ chrome devices that we as a team manage. Jamf setup takes a hot second, but the maintenance, management, and deployment is a piece of cake once setup. I have another guy who can assign profiles and users to enroll Macs when they come into the shop and need wiped, but he isn't familiar with the creation of the profiles, device groups, account settings, etc. We also have a break glass admin account with all privileges.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-07-26 17:34:37",
        "upvotes": 1,
        "relevance_scores": 8,
        "id": 25,
        "summary": "Jamf simplifies the maintenance, management, and deployment of Apple devices after initial setup, streamlining profile assignments and user enrollments for efficient device management."
    },
    {
        "author": "Sea-String7303",
        "url": "https://reddit.com/r/jamf/comments/1f69eop/scripts_using_jamf/ll19wz3/",
        "body": "I’m on JAMF school. It’s affordable being that $9 per device per year. What I meant by saving money is not hiring an expert and trying to manage devices on my own.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-09-01 19:29:41",
        "upvotes": 2,
        "relevance_scores": 8,
        "id": 26,
        "summary": "Jamf School offers affordable device management at $9 per device annually, enabling users to manage devices independently without hiring an expert."
    },
    {
        "author": "MacAdminInTraning",
        "url": "https://reddit.com/r/macsysadmin/comments/1d77w8d/update_os_trough_jamfpro/l6yf1pi/",
        "body": "You can only manage OS updates through MDM. JAMF has the MDM and DDM commands for OS updates on the left side bar. \n\nApples management of OS updates leaves a lot to be desired. \n\nTools like nudge and Superman are fine for user notifications, but they do nothing more than notify the user. If the user does not elect to install the update manually, those tools cannot force the device to update and due to that are not really worth the headache in configuration anymore.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-06-03 19:24:15",
        "upvotes": -1,
        "relevance_scores": 8,
        "id": 27,
        "summary": "Jamf provides MDM and DDM commands for managing OS updates, offering more effective solutions than tools like Nudge and Superman, which only notify users."
    },
    {
        "author": "theitguy1969",
        "url": "https://reddit.com/r/jamf/comments/1e67nu7/jamf_connect_worth_it/lds1l2t/",
        "body": "We went from devices being bound to AD (which you never want to do!) to Jamf connect. I absolutely recommend it!  Yes your users will have 2 logins, 1st one being unlocking filevault drive and second will be the Azure log in. Jamf connect keeps the Azure password in sync with the local account password so the user doesnt have to manage multiple passwords.  I cant image what your current management is for accounts on devices right now.  Its especially slick on Zero touch deployments ,it will create the local account on 1st login  to a device.  but as long as the users just put their device to sleep or set up a fingerprint , the only time they really need to log in twice is after a reboot.",
        "subreddit": "jamf",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-07-18 14:45:11",
        "upvotes": 4,
        "relevance_scores": 8,
        "id": 28,
        "summary": "Jamf Connect simplifies device management by syncing Azure and local passwords, streamlining logins, especially effective for zero-touch deployments and reducing password management hassle."
    },
    {
        "author": "handsomemagenta",
        "url": "https://reddit.com/r/sysadmin/comments/mb4pmf/does_jamf_think_were_idiots/grxtg0b/",
        "body": "Agreed. We’re in the 90% range of Macs deployed with some PCs sprinkled in. I’ve been a Jamf SME for over a decade and can tell you the product has become better and has made our lives easier to manage. Trying to learn Endpoint Manager is a bit of a learning curve but slowly noticing the parallel setups and configs needed.\n\nThe alternatives to Jamf are out there, it’s just Jamf has a longer road to build their product on. It was an answer to Apple not being “enterprise” friendly. They’ve also added resources to the company to grow them globally. \n\nI would say Jamf makes it easier for admins and end users to use Macs.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2021-03-23 15:35:48",
        "upvotes": 2,
        "relevance_scores": 8,
        "id": 29,
        "summary": "Jamf simplifies Mac management for admins and users, evolving over a decade to enhance enterprise compatibility and global growth, despite learning curves with alternatives."
    },
    {
        "author": "Dazed1",
        "url": "https://reddit.com/r/macsysadmin/comments/1e08ffh/thoughts_on_jamf_protect/lclqedo/",
        "body": "We use it on ~1,100 endpoints. It rarely hits on anything. The ability to block execution of software by bundle ID or team ID is handy. The CIS benchmarks are a neat feature as well. We get a bundle deal on it along with Jamf Pro and Connect. The best part is probably how easy it is to deploy as there is a built-in integration with Jamf Pro to deploy everything needed. It also has probably the best day-1 support for new macOS versions out of any EDR. Even SentinelOne, etc has had compatibility issues where they are scrambling to patch something that broke due to an update or major OS release. I don’t know how it stacks up as far as MITRE evaluations against other EDR products but I’m pretty happy with it. S1 is a bit more work to deploy and maintain. Not that it isn’t worth it. We run both on a couple VIP endpoints.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-07-11 00:50:48",
        "upvotes": 5,
        "relevance_scores": 8,
        "id": 30,
        "summary": "Jamf offers seamless deployment, strong macOS support, and useful features like software blocking and CIS benchmarks, making it a preferred choice over other EDRs."
    },
    {
        "author": "EnricoDandoloThaDOV",
        "url": "https://reddit.com/r/macsysadmin/comments/1e08ffh/thoughts_on_jamf_protect/lcpbkzp/",
        "body": "Currently using it in our environment of ~5000 devices. A few takeaways:\n\n- pretty easy to deploy. Basically a .app package with a configuration profile. Syncing plans with your Jamf Pro Server is also a nice way to keep the various Plan configurations you make up to date. \n- Analytics is a pretty powerful feature. Takes some investment in learning how to write queries (this is also changing soon), but once you know how to do it there's a lot you can do with it.\n- the Jamf Security Cloud portion has a slightly harder configuration, because it a bit confusing on how to actually get the data from your endpoints that you want. \n- works best when you have a dedicated SIEM tool you're already using. Data Forwarding sources are pretty flexible for sending Telemetry Data, but they really intend for you to do a lot of analysis of events outside of the Mac Security Portal.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-07-11 17:17:10",
        "upvotes": 3,
        "relevance_scores": 8,
        "id": 31,
        "summary": "Jamf is effective for deploying and managing ~5000 devices, offering powerful analytics and flexible data forwarding, though security configuration can be complex."
    },
    {
        "author": "MikaelDez",
        "url": "https://reddit.com/r/macsysadmin/comments/199xtu4/why_is_sentinelone_better_than_jamf_protect/kikr5bw/",
        "body": "I’m surprised to read your experience with Jamf, it’s honestly made my job easier and it’s made my Mac environment super stable and easy to manage. Granted I haven’t tried alternatives, but I really couldn’t see how any other MDM would dethrone Jamf for me unless they had actual solutions that Jamf couldn’t solve",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-01-19 11:52:25",
        "upvotes": 2,
        "relevance_scores": 8,
        "id": 32,
        "summary": "Jamf significantly simplifies job tasks, stabilizes Mac environments, and is preferred over alternatives unless they offer solutions Jamf cannot provide."
    },
    {
        "author": "hunterkll",
        "url": "https://reddit.com/r/sysadmin/comments/14z0oop/company_wants_me_to_integrate_jamf_not_sure_how/jrvncbe/",
        "body": "I wouldn't use anything but JAMF, no matter how many machines. JAMF is #1 for a reason, and for small amounts of machines, very cheap. I'd peg intune as almost #2 at this point and it's not great. AirWatch etc can all go in a dumpster. The others just aren't feature complete. \n\n&#x200B;\n\nJAMF cloud is super easy to set up if you go that route, and if you need to do things like conditional access integration, JAMF cloud is the best and easiest route bar none.",
        "subreddit": "sysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2023-07-14 01:18:42",
        "upvotes": 10,
        "relevance_scores": 8,
        "id": 33,
        "summary": "JAMF is the top choice for managing any number of machines, offering easy setup and superior features, especially with JAMF cloud for integration needs."
    },
    {
        "title": "What is the future of Jamf? I got an offer as a Jamf administrator. Should I accept?",
        "author": "MikaelDez",
        "url": "https://qr.ae/p2ZQHa",
        "body": "Thanks for your question. I think Jamf is a solid player in the mobile device management (MDM) and Mac management space. The company has a historic relationship with Apple Field Engineering and is used by Apple internally to manage Apple Retail Store devices. Their support teams have historically been very good, industry leading, but they do have some struggles due to being a bootstrapped company (started in 2002, VC acquisition in 2017, IPO 2020).\n\nIMO there is questionable leadership and they continually access consultants to support their operations, which is common for a large, complex organization. They also struggle with diversity and inclusion, which has become more important in recent years for financial and operational success. The quality of their software and support has slipped over the years due to these recent changes, which enables them to stay current with the market.\n\nWith Fleetsmith being acquired by Apple, versus Jamf, I think the writing is on the wall. Historically companies that are acquired tend to implode, however Jamf went IPO in 2020. It remains a modern tool for Apple device management.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "created": "2024-01-19 11:52:25",
        "upvotes": 2,
        "platform": "Quora",
        "relevance_scores": 8,
        "id": 34,
        "summary": "Jamf is a key player in Apple device management, known for strong support but faces challenges in leadership, diversity, and maintaining software quality."
    },
    {
        "title": "JAMF Pro has good support and training",
        "author": "Steven P.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9717850",
        "body": "I really enjoy the support that we receive from our representative at JAMF. They give us a detailed meeting every month and go over any new features that maybe helpful to our company and ask us any new projects we are working on and any help they can offer. They have helped many times with projects when we get stuck or offer alternate solutions to things. I am also very pleased with the training classes for getting certified in JAMF. The instructors are very informative and know their stuff. It is great getting to meet other people in the class and finding out how they are using JAMF. I also very excited to get to attend JNUC in October to meet more people and see how they are using JAMF to manage their environments and to also learn about new features. I use JAMF on a daily basis to monitor our users mobile devices and help with the return of termed users equipment.The learning curve seemed a bit steep. It wasnt until I started taking the training that I was able to truely use the product in more consisive ways. I do wish the UI was a bit more user friendly... with the latest updates it did get better but I feel there is still some room for improvements.We are a fully remote company. We ship the users computers of which they need to setup themselves. JAMF has made it so we can do this with little stress to the user and ensure machines are properly setup from a security standpoint. It also enables us to be able to ensure we have a tool to get assets back from termed employees.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 35,
        "summary": "JAMF provides excellent support, detailed monthly meetings, and effective training, facilitating device management and security for remote companies, despite a steep learning curve and UI improvements needed."
    },
    {
        "title": "Robust system, great customer service",
        "author": "Sharon D.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9630398",
        "body": "Jamf Pro makes it really easy for us to manage our iPads and MacBooks. The app catalog for MacBooks is especially helpful, so we don't have to package software as often. Being able to customize the way our devices enroll is also helpful. It integrates with Google, which means that our students and staff can have the same login information across the board. The more we learn about its capabilities, the more fine tuned we can be with our management, but even with our basic knowledge at the beginning we could set it up well enough to get things started. The best thing about Jamf, though, is the customer service team. They are diligent and helpful and quick to either find you a solution or find the right person to get you a solution.There are some features that they are lacking or are behind other MDMs in developing. It seems like between them and Mosyle, it's always a race to see who is going to implement what first and better. Mosyle was first to implement an app catalog and admin privilege requests, and their user interface looks a lot more user friendly than Jamf. Some aspects in Jamf, like configuration profiles, it can be difficult to know what settings mean without having a deep working knowledge of Apple's infrastructure. It would be nice if settings had a description of \"enabled means this\" and \"disabled means this\".It keeps our device management and asset database all in one place. We have one pane of glass for seeing our fleet of devices.",
        "useful": "0",
        "sentiment": "4",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 4,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 36,
        "summary": "Jamf Pro simplifies iPad and MacBook management with an app catalog, Google integration, and excellent customer service, though it trails competitors in some features."
    },
    {
        "title": "One stop MDM",
        "author": "Lee G.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9711756",
        "body": "SInce moving to Jamf Cloud, all functions have improved including package distribution using cloud DP's and the ability to reach all devices off the corporate network. This is now allowing many new cloud based integrations with  Azure, Jamf Connect, etc.The level service desk seems to have some challenges, but they have improved the support work flow.We are trying to take advantage of MDM mass action commands for Apple Software Updates, using DDM especially for Apple Silicon devices and forcing reboots. At this time, it is not actually production and not 100% reliable yet.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 37,
        "summary": "Jamf Cloud enhances package distribution and device reach, supports new integrations, and improves support workflow, though MDM mass action commands remain unreliable for production."
    },
    {
        "title": "Been on Jamf since Casper!",
        "author": "Matthew S W.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-8051815",
        "body": "Simplest management for macOS that I have experienced. Allowed me to easily create a near zero-touch deployment model that our Service Center loves.I wouldn't say there are downsides. The few issues I have are really related to our legacy on-prem environment not having script editing on the site.Mass management of our macOS fleet. We have easily been able to configure a consistent security baseline that we can be sure is securing our endpoints.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 38,
        "summary": "Jamf simplifies macOS management, enabling near zero-touch deployment and consistent security baselines, despite minor legacy on-prem environment script editing issues."
    },
    {
        "title": "Outstanding MDM",
        "author": "John H.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-6597811",
        "body": "Ability to create pre-stage enrollments, saving time when re-imaging iPads every summer. Also, the support you get from Jamf is second to none. Overall, a Great product!Not a whole lot to dislike about this product. It just works.Jamf Pro allows you to remotely manage your devices (both iPads and Macs) with great ease.I can now remotely manage our iPads and install applications as needed and/or requested by teachers.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 39,
        "summary": "Jamf Pro streamlines device management by enabling pre-stage enrollments, remote management, and application installations, with exceptional support and user-friendly functionality for iPads and Macs."
    },
    {
        "title": "Jamf Pro in a K-12 environment",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9631918",
        "body": "Jamf Pro is a reliable MDM that is easy to understand. We've had the best experience with the Jamf Cloud environment. Jamf Pro helps to keep all of our Apple devices up to date with the latest software versions and OS patches. Our Jamf Pro instance is accessible 24/7/365 from any location with an internet connection. In emergencies, I've accessed the admin console from my phone! The Jamf Nation community is by far, the best resource for troubleshooting, exchanging ideas, and collaboration with other Jamf users around the world.Whenever I find gaps in our MDM, I quickly fill out a feature request. I will also upvote other feature requests that would be helpful in improving the Jamf Pro experience. I've used Jamf for 10 years now and I've seen how much the platform has improved.Jamf Pro provides centralized management of endpoint deployment, application management, end user autonomy, and device security. This saves us countless hours of IT labor and creates happy end users.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 40,
        "summary": "Jamf Pro is an effective MDM solution offering centralized Apple device management, accessible globally, with strong community support and continuous feature enhancements."
    },
    {
        "title": "Jamf continues to be the go to Mac MDM in the market!",
        "author": "Michael Z.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9629966",
        "body": "easy to use interface.  Integration with All Major platforms like intune. Jamf Nation is a great community ready to help each other out with issues as they arise.device count can get high and out of hand leading to high costs if you don't unmanaged/remove unused devices.applying config profiles and managing devices in our org. we can push policies and updates instantly and it saves our team a ton of time.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 41,
        "summary": "Jamf offers an easy-to-use interface, integrates with major platforms, and provides community support, but managing high device counts can lead to increased costs."
    },
    {
        "title": "Best MDM for Apple devices that we know",
        "author": "Joris K.",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9641753",
        "body": "The simplicety it all comes togehter and how easy to understand the management user interface is. Though your can configure real advanced configuration with Jamf to mange your Apple fleet, it is very easy to get used to the portal. Before you know it you will get the hang of it and are deploying scripts, applications and polcies.The monitoring of policies and applications on what is being applied or not can be sluggish to work withhJamf is helping us manage our Mac OS fleet. We currently only have Macbooks in it. No matter where they are, IT (us), are always in control.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 42,
        "summary": "Jamf provides an intuitive management interface for configuring advanced settings, deploying scripts, and monitoring policies, ensuring control over your Apple device fleet."
    },
    {
        "title": "Excellent solution for our organization",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8686430",
        "body": "When I started at my company four years ago, the team was binding Apple computers to the domain.  There were constant issues cropping up, and support tickets on a regular basis in regards to password changes and sync issues.  We were already a Jamf customer and I came across Jamf Connect.  After implementing Jamf Connect in our org, we've been able to enforce password policy with far less headache and less support request from users. The product is easy to use and the password change process is easy enough for users to remember with very little instruction from the IT side. Updating Jamf Connect is as simple as pushing out a new policy from Jamf Pro, which is really nice as well.The UI for password changes has been updated over time by Jamf, but could still perhaps be a little easier for end users to understand,. perhaps more graphics and different verbiage through the process?Using Jamf Connect, we don't have to bind Macs to our domain, which prevents a number of support issues from cropping up.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 43,
        "summary": "Implementing Jamf Connect reduced support requests and simplified password management, eliminating the need to bind Macs to the domain, enhancing user experience."
    },
    {
        "title": "Jamf Admin - Tufts University",
        "author": "Denise L.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8633866",
        "body": "We have just started using Jamf Connect in order to deploy macs with zero touch technology.  It is invaluable to the process and wouldn't be possible in our environment without this product.  The ability to have our users set up their own device by signing in through Jamf Connect and then syncing their passwords for ease of one password is something that our users have come to expect and we are so happy to provide this to users with a dropped shipped Mac that we haven't touched at all.It is still new to us so we are still learning all the ins and outs but would like to see greater compatibility with different identity platforms since we don't use Okta like most others do.  All in all, don't have anything bad to say at this point in time in our processes.Zero Touch deployment for remote and on site staff for macs.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 44,
        "summary": "Jamf Connect enables zero-touch Mac deployment, allowing users to set up devices independently, enhancing password management, though compatibility with diverse identity platforms is desired."
    },
    {
        "title": "Jamf Connect streamlines onboarding even further!",
        "author": "David M.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8560036",
        "body": "I've helped many organizations intergrate both their Azure AD and Google Workspace directories into Jamf Pro using Jamf Connect. While initial deployment includes some complexity, the custom experience we can create for users is unmatched. Not to mention the simplicity of allowing a user to basically self-provision a Mac without direct IT involvement. Game changer.No downsides to the product we've seen so far. We do recommend taking advantage of Jamf's on-boarding support as every customer we've taken onto the platform has encurred some form of customization. And the integration requires advanced understanding of Jamf Pro, Jamf Connect as well as the directory provider interface. But it's well worth the energy once you watch a user un-box a factory Mac and quickly get to a fully configured desktop complete with a user account, mail, apps, documents, and preferences -- all with zero IT touch.Without full directory integration and user account snycronization, we were assigning IT staff to perform user account creation for each end user. While we could push apps and services with Jamf Pro, Jamf Connect added the final step. Now a user simply logs into a properly enrolled company-owned Mac with their email credentials ... and magically a full, local user account is created. And if a password is changed on the Mac or at the directory server, the password is sync'd between platforms. We reclaim IT services for both deployment and forgot password support. Win-Win.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 45,
        "summary": "Jamf Connect simplifies Mac provisioning by integrating Azure AD and Google Workspace, enabling user self-provisioning and reducing IT involvement, enhancing efficiency and user experience."
    },
    {
        "title": "I heart Jamf Connect",
        "author": "Samantha H.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8764360",
        "body": "Ease of Use. That you set it up and it works!That unless you specfically set it up to do otherwise, you must be online to log in.We were using just local accounts, and then we started using Nomad (with AD credentials) but Nomad never quite worked right. There were always bugs and issues. With Jamf Connect- we were able to not use local accounts, but to use azure credentials and only have one password which was so much better than Nomad and no one ever remembering to update it when they changed their AD password. Jamf Connect just made my day as an admin so mcuh better and easier. It just worked.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 46,
        "summary": "Jamf Connect simplifies admin tasks by enabling Azure credential use, replacing local accounts, and resolving issues faced with Nomad, enhancing overall efficiency."
    },
    {
        "title": "Simplify Mac Deployment",
        "author": "Jeff A.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8023151",
        "body": "Jamf Connect has allowed us to give our end-users brand-new Macs without my team having to touch the device ahead of time. This saves my team and our end users a lot of time. The setup of a new Mac for the end user is simple and we get very few help desk calls related to a new Mac deployment.Getting set up with Jamf Connect is not for the faint of heart. Thankfully, Jamf includes professional services to get the environment set up and there is a great support community at Jamf Nation and on the #jamfconnect channel at the MacAdmins Slack site.SInce we are 100% remote as a company, there was a challenge of getting new computers to end users. Jamf Connect handles the macOS user account creation and leverages Jamf Policies to push required software to new Mac automatically.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 47,
        "summary": "Jamf Connect streamlines remote Mac deployments, reducing setup time and support calls, while providing robust support through professional services and community resources."
    },
    {
        "title": "Jamf Connect makes our Mac Deployment really user-friendly.",
        "author": "Niklas K.",
        "url": "https://www.g2.com/products/jamf-connect/reviews/jamf-connect-review-8225925",
        "body": "Jamf Connect helps us immensely in the company, whether it's the initial set-up of MacBooks by employees or changing passwords. The range of functions cannot be listed completely in this review.So far, we have hardly noticed any weaknesses. We once had a bug with an SSO extension, but it was immediately fixed with the next update. Thanks again to the support.We use Jamf Connect in the initial setup to create the local account. During operation, we then synchronise the password via Jamf Connect.\nJamf Connect has made it possible for us admins to no longer have to hold a MacBook in front of the user.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "8",
        "rating": 4.5,
        "platform": "G2 ",
        "relevance_scores": 8,
        "id": 48,
        "summary": "Jamf Connect streamlines MacBook setup and password management, enhancing efficiency and reducing admin intervention. It offers reliable support and quick bug fixes."
    },
    {
        "author": "Alternative_Sense938",
        "url": "https://reddit.com/r/macsysadmin/comments/1bnj9fv/jamf_vs_kandji_in_2024/kwl3kk6/",
        "body": "We switched from Jamf Cloud with Connect to Kandji two months ago. So far we absolutely love it. To us, Jamf was a toolbox whereas Kandji was ready to use out of the box. We love the layout and readability of the console, even the creature comforts like being able to see details about a blueprint item without having to go to the library whereas Jamf would require you to open another tab to compare two pages. The things visible to the user, such as Passport and the agent, have a much nicer appearance and appear to belong in macOS, unlike Jamf.\n\nWe had our demo environment doing great in one week. Most of our profiles were recreated and configured within a week. We find Passport to be more reliable and user-friendly than Connect. Liftoff has worked perfectly. The user agent does well to inform the user of updates or actions needed.\n\nWe actually migrated at a fast pace. Our Jamf contract was ending two weeks from the day we signed with Kandji, and since they don't let you test the migration tool we risked it.\n\nWe had one major migration hurdle: Jamf was deploying Wi-Fi via a config profile. As soon as Kandji forced Jamf to unenroll a device it would lose the office Wi-Fi connection and the device was stranded because the deletion of the config profile removed the active SSID. To mitigate, we started a temporary Wi-Fi network, pushed it as a script, and then the Kandji migration tool would wait long enough for the device to see the temp network and connect.\n\nWe made it! Before Jamf expired we sent all remaining devices (there weren't many) an MDM unenroll command from Jamf. In Apple Business Manager we pointed all devices to Kandji. Then those devices could do sudo profiles -N to re-enroll based on what Apple Business Manager pointed them to.\n\nKandji's use of rules on blueprint items means we only need a few blueprints. We chose to do one blueprint for production, one for conference room equipment, and one for secured special devices. Other blueprints can be used for testing.\n\nKandji Prism is a new search feature that works well.\n\nIt's nice that Kandji licenses users instead of devices. We can now enroll iPads, iPhones, and Apple TVs along with Macs.\n\nI do have to give Kandji one F grade: You're assigned a migration specialist at the start. This is who provides your custom migration script. In our case the specialist only responded to us about once a day no matter how urgent. They also said more than once that they had added colleagues to our case but we never heard from anyone else. On the flip side, chat support and their documentation has been great.\n\nIf you are looking for something that works well from the start, Kandji is not a bad choice. I'm looking forward to full Platform SSO authentication support next year. (Giving it time in the oven.) Apple is still polishing it and Kandji supports it but we want to let them work any bugs out.",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "7",
        "created": "2024-03-26 02:23:00",
        "upvotes": 7,
        "relevance_scores": 7,
        "id": 49,
        "summary": "The switch from Jamf to Kandji was smooth, with Kandji offering a user-friendly, ready-to-use interface, efficient migration, and better device management features."
    },
    {
        "title": "Jamf Didn’t Meet Our Needs in Fintech",
        "author": "MikaelDez",
        "url": "https://www.quora.com/Is-JAMF-a-server",
        "body": "As an IT Manager for a fintech company with 5,000+ employees, we implemented Jamf hoping it would streamline device management, remote support, and patching. Unfortunately, it didn’t meet the demands of our environment.\n\nThe remote assistance tools were slow and unreliable, with frequent connection drops during sessions—frustrating for both IT and end-users. Patch management was inconsistent, with some critical updates failing to apply automatically, requiring manual intervention. The inability to schedule patches flexibly across time zones also disrupted our global workforce.\n\nWhile Jamf offers a lot of features, the learning curve was steep. Even my experienced team needed weeks to get comfortable, and documentation wasn’t easy to navigate in urgent situations. Scalability was another issue, as bulk actions failed randomly without clear error messages, slowing down operations. The reporting tools were too basic for the compliance requirements we need in fintech.\n\nJamf may work for smaller companies, but for large, compliance-heavy environments, it didn’t deliver. We’re already exploring alternatives that offer more reliable patching, better remote support, and smoother scaling.",
        "useful": "0",
        "sentiment": "3",
        "customer_useful": "0",
        "relevance_score": "9",
        "created": "2024-05-02 11:52:25",
        "upvotes": 9,
        "platform": "Quora",
        "relevance_scores": 9,
        "id": 50,
        "summary": "Jamf struggled to meet the demands of a large fintech company, with issues in remote support, patch management, scalability, and compliance, prompting a search for alternatives."
    },
    {
        "title": "Jamf is a must have for any Apple centric organization",
        "author": "NOT GIVEN",
        "url": "https://www.g2.com/products/jamf-pro/reviews/jamf-pro-review-9713216",
        "body": "One of the most powerful things about Jamf in my opinion are smart groups. The ability to granularly sort through devices in your instance is a massive time saver. It also makes deploying apps and polices a breeze. Aside from that, the amount of features available for finely tuning mobile devices is second to none.\n\nOutside of the Jamf Pro itself, our customer success rep Taylor is phenomenal. She is always availble to answer our questions, has a wealth of knowledge when it comes to Jamf, and in the rare occurence where she doesn't have the answer, she will either put us in touch with who does or gets back to us lightning fast!I wish there was the ability to drag and drop your categories to sort them how you like. Removing and adding everything 1 by 1 is tedious.As a remote company, being able to deploy devices with minimum of user interaction for setup is crucial. Our onboarding process has been streamlined with the help of Jamf and allowed the IT team to minimize our weekly footprint within those meetings.\n\nKeeping track of our 1000+ devices and making sure we're staying in our compliances and staying on top of application and OS updates.",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_score": "9",
        "rating": 5,
        "platform": "G2 ",
        "relevance_scores": 9,
        "id": 51,
        "summary": "Jamf's smart groups streamline device management and app deployment, enhancing efficiency. Its robust features and exceptional customer support optimize remote onboarding and compliance for over 1000 devices."
    },
    {
        "author": "Cosmic_Shipwright",
        "url": "https://reddit.com/r/macsysadmin/comments/1ci9yqg/moving_from_jamf_to_kandji/l2fnihw/",
        "body": "We moved from Kandji to Jamf and although Jamf has a bit of a learning curve, it’s worth it. The compliance editor template is a godsend for quickly applying security policies and the patch management is rock solid compared to Kandji. Kandji also offers less flexibility in terms of pricing. You still have to pay for 50 or 100 devices even if you have half of that and you have to get the entire suite (passport was optional before). There was also a nasty bug we encountered where even after we removed the Kandji MDM profile, the passport (IdP SSO) still stuck around and we weren’t able to enroll it to Jamf forcing us to wipe it. Their initial sales rep also gave us a pricing commitment for 3 years but when it came to renewal after one, the account manager was rotated and they jacked up our prices saying “I don’t know that guy but here’s what we charge.”",
        "subreddit": "macsysadmin",
        "useful": "0",
        "sentiment": "2",
        "customer_useful": "0",
        "relevance_scores": 9,
        "created": "2024-05-03 18:27:57",
        "upvotes": 3,
        "id": 52,
        "summary": "Switching from Kandji to Jamf improved security policy application and patch management. Jamf offers better pricing flexibility, despite an initial learning curve."
    }
]
